[{"title": ["Spotify spent more than $1 billion to build a podcasting empire.", "The bet hasn’t paid off."], "text": ["Spotify’s $1 Billion Podcast Bet Turns Into a Serial Drama\n\nThe prospect of podcast riches led to aggressive investments in celebrity deals and original programming for what appeared a sky’s-the-limit media frontier  \nSpotify spent more than $1 billion to build a podcasting empire.", "It struck splashy deals with Kim Kardashian, the Obamas and Prince Harry and Meghan Markle.", "It paid $286 million for a pair of podcast studios and spent $250,000 and more an episode on exclusive shows to lure new listeners.", "The bet hasn’t paid off.", "Most of its shows aren’t profitable, according to people familiar with the matter, and the company has recently cut staff and programming to slow its losses.", "The company, which has struggled to report consistent profits, lost €527 million, equivalent to about $565 million, in the six months ending in June, on €6.2 billion in revenue.", "No one in the business is making much money on podcasts, but Spotify, which has spent far more on the medium than its rivals, has more to lose than most.", "Spotify’s competitors, including Amazon, Apple and Google, tech behemoths with their own audiostreaming services, have other, more profitable businesses.", "Source: https://www.wsj.com/business/media/spotify-podcast-gimlet-harry-meghan-kardashian-59866a5d"]}, {"title": ["The End of Airbnb in New York: Local Law 18 goes into force, potentially wiping out thousands of Airbnbs"], "text": ["THOUSANDS OF AIRBNBS and short-term rentals are about to be wiped off the map in New York City.", "Local Law 18, which came into force Tuesday, is so strict it doesn’t just limit how Airbnb operates in the city—it almost bans it entirely for many guests and hosts.", "From now on, all short-term rental hosts in New York must register with the city, and only those who live in the place they’re renting—and are present when someone is staying—can qualify.", "And people can only have two guests.", "In 2022 alone, short-term rental listings made $85 million in New York.", "Airbnb’s attempts to fight back against the new law have, to date, been unsuccessful.", "There are currently more than 40,000 Airbnbs in New York, according to Inside Airbnb, which tracks listings on the platform.", "As of June, 22,434 of those were short-term rentals, defined as places that can be booked for fewer than 30 days.", "Source: [https://www.wired.com/story/airbnb-ban-new-york-city/](https://www.wired.com/story/airbnb-ban-new-york-city/)\n\n&#x200B;"]}, {"title": ["Lost 90k gambling, don't make the same mistakes as me"], "text": ["I invested in meme stocks and traded options, now I down almost 100,000 dollars.", "I am 35 years old and I only have 55,000 dollars left to my name.", "I hope you guys are smarter than me and don't make stupid decisions.", "You won't get lucky.", "Invest in index funds and slowly keep accumulating wealth.", "This is not a get rich quick scheme.", "Years and years of saving straight down the toilet.", "I watch tickers all day long and stress over the tiniest moves in stock price.", "All for what?", "To get cleaned out.", "Don't be like me kids.", "The market is not your friend in the short term.", "Have a good day."]}, {"title": ["UPS Signs minimum hourly wage increase of 35.5% for part-time workers and average total driver compensation to $170,000."], "text": ["https://www.cnbc.com/2023/08/22/ups-workers-approve-new-labor-contract.html\n\n* Part time workers will make $21 from currently $15.50.", "* Full time workers will be paid $49 an hour an increase of $7.50 over the contract.", "Total compensation with benefits will be $170,000.", "* Average base pay before overtime or benefits will be approximately $102,000.", "* The new contract includes pay raises for both part-time and full-time workers.", "* It also includes other improvements to work rules including an end to forced overtime.", "* Workers began voting on the new contract on August 2.", "American Airlines also approved 46% increase in compensation and the UAW is also demanding 46% increase in compensation, voting on August 22nd whether or not to authorize a strike.", "UPS workers ratified a massive five-year labor deal that includes big wage increases and other improvements to work rules and schedules, the International Brotherhood of Teamsters said Tuesday.", "The deal passed with 86.3% of votes, the highest contract vote in the history of Teamsters at UPS, according to the union.", "“Teamsters have set a new standard and raised the bar for pay, benefits, and working conditions in the package delivery industry.", "This is the template for how workers should be paid and protected nationwide, and nonunion companies like Amazon better pay attention,” Teamsters General President Sean O’Brien said in a statement.", "UPS and the Teamsters union, which represents about 340,000 workers at the delivery giant, reached a preliminary deal last month, narrowly averting a strike that could have rippled throughout the U.S. economy as the previous contract expiration on July 31 approached.", "UPS moves $3.8 billion worth of goods a day, about 5% of the country’s gross domestic product, according to the U.S. Chamber of Commerce.", "The parties had until July 31, when the previous labor contract was set to expire, to reach a deal and avoid a work stoppage.", "Workers began voting on the new contract on August 2.", "It’s the single largest collective bargaining agreement ever reached in the private sector, according to the union.", "Part-time workers will make no less than $21 an hour, up from a minimum of $15.50 currently, according to the union.", "Part-time pay was a sticking point during labor negotiations.", "Full-time workers will average $49 an hour.", "Current workers will get $2.75 more an hour this year and $7.50 an hour more during the five-year contract.", "UPS drivers will average $170,000 in pay and benefits at the end of the five-year deal, CEO Carol Tomé said on an earnings call earlier this month.", "The company cut its full-year revenue and margin forecasts, citing the “volume impact from labor negotiations and the costs associated with the tentative agreement.”\n\nThe union is the latest labor organization to push a major U.S. company for better pay, schedules and other work rules in the wake of the pandemic and decades-high inflation.", "On Monday, American Airlines\npilots ratified a four-year deal that includes roughly 46% increases in compensation, including 401(k) contributions, a deal the carrier sweetened after rival United Airlines reached a richer agreement with its pilots’ union.", "Delta Air Lines\n\n’ pilots approved their deal, which include more than 30% raises, earlier this year.", "Southwest Airlines\n\nhasn’t yet gotten to a deal with its pilots’ union, which has laid the groundwork for a potential strike, though such stoppages in the airline industry are exceedingly rare under U.S. laws.", "FedEx pilots turned down a tentative agreement for a new labor contract earlier this summer."]}, {"title": ["Nvidia reports 88% jump in revenue and tops estimates, driven by demand for AI chips"], "text": ["Nvidia reports 88% jump in revenue and tops estimates, driven by demand for AI chips https://www.cnbc.com/2023/08/23/nvidia-nvda-earnings-report-q2-2024.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard\n\nNvidia reported second-quarter earnings that beat elevated expectations for earnings and revenue, and provided guidance for the current quarter that was significantly higher than expected.", "Shares rose 9% in extended trading.", "Earnings: $2.70 a share, adjusted, versus $2.09 per share expected by Refinitiv.", "Revenue: $13.51 billion versus $11.22 billion expected by Refinitiv.", "Nvidia said it expected third-quarter revenue of about $16 billion, higher than $12.61 billion forecast by Refinitiv."]}, {"title": ["Dick’s stock just dropped 20% after citing theft as one of the reasons."], "text": ["Are brick n mortar stores using theft as a lazy excuse for poor numbers as it allows an easy scapegoat, or are the margins that thin where this is a legitimate concern for all store retailers?", "\"While we posted another double-digit [earnings before taxes] margin, our Q2 profitability was short of our expectations due in large part to the impact of elevated inventory shrink, an increasingly serious issue impacting many retailers,\" she added, using the industry term for theft.“\n\nTGT has stated an “unacceptable” amount of theft, which all theft is, but they didn’t clarify exactly how much, leading to the question- how do you that price in as an investor, and does the ability to mitigate theft become an investing metric you factor in, or do you just look at the bottom line, regardless of how the company got there?"]}, {"title": ["American workers are demanding almost $80,000 a year to take a new job, a 14% increase over the past year."], "text": [">*The amount of money most workers want now to accept a job reached a record high this year, a sign that inflation is alive and well at least in the labor market.", "*\n\n* The average “reservation wage,” or the minimum acceptable salary offer to switch jobs, rose to a record $78,645 during the second quarter of 2023.", "* Employers have been trying to keep pace with the wage demands, pushing the average full-time offer up to $69,475, a 14% surge in the past year.", "* The numbers are significant in that wages increasingly have been recognized as a driving force in inflation.", "----------------------------\n\nAccording to the latest New York Federal Reserve employment survey released Monday, the average “reservation wage,” or the minimum acceptable salary offer to switch jobs, rose to $78,645 during the second quarter of 2023.", "That’s an increase of about 8% from just a year ago and is the highest level ever in a data series that goes back to the beginning of 2014.", "Over the past three years, which entails the Covid era, the level has risen more than 22%.", "The number is significant in that wages increasingly have been recognized as a driving force in inflation.", "While goods prices have abated since pushing overall inflation to its highest level in more than 40 years in mid-2022, other factors continue to keep it well above the Fed’s targeted rate of 2%.", "The New York Fed data is consistent with an Atlanta Fed tracker, which shows wages overall rising at a 6% annual rate but job switchers seeing 7% gains.", "Employers have been trying to keep pace with the wage demands, pushing the average full-time offer up to $69,475, a 14% surge in the past year.", "The actual expected annual salary rose to $67,416, a gain of more than $7,000 from a year ago and also a new high.", "Though there was a gap between the wage workers wanted and what was offered, satisfaction with compensation and upward mobility increased across the board.", "With markets on edge over what the Fed’s next policy step will be, more signs of a tight labor market raise the likelihood that policymakers will keep interest rates higher for longer.", "At their July meeting, officials noted that wages “were still rising at rates above levels assessed to be consistent with the sustained achievement” of the 2% inflation goal, minutes from the meeting said.", "Monday’s survey results also showed some other mixed patterns in the labor market.", "Job seekers, or those who have looked for work in the previous four weeks, declined to 19.4% from 24.7% a year ago.", "That came as job openings fell by 738,000 to 9.58 million, according to the Bureau of Labor Statistics.", "The likelihood of switching jobs fell, dropping to 10.6% from 11% a year ago, while expectations of being offered a new job also declined, to 18.7% from 21.1%.", "https://www.cnbc.com/2023/08/21/american-workers-are-demanding-almost-80000-a-year-to-take-a-new-job.html"]}, {"title": ["How does Tesla go up 7% after all the news about Elon Musk’s autopilot incident?"], "text": ["I guess I need to add this: I do **not** own any stocks or shorts or puts or whatever related to Tesla, because the way that Tesla works in the market confuses me.", "I just want to learn.", "Everybody also thinks this is an attack on Tesla and Musk.", "It is **not**.", "I want to know if this is the way that the market works or not.", "Why do I care?", "Because Tesla is relatively a gigantic company.", "Why did I ask about if the same would happen with Apple?", "Because Apple is also a relatively gigantic company.", "I thought you were allowed to ask about stocks on this sub.", "———\n\nOn Friday August 25th, [Elon Musk posted a video on X](https://x.com/elonmusk/status/1695247110030119054?s=46&t=0YLBKtmQe8-F_nJ00NQvxg), that now has 44 million views, of him driving a Tesla on autopilot.", "In the video he has to brake the car himself when it almost runs a red light (at around 19:45).", "It also received a decent amount of news coverage.", "This appears to have not affected the stock’s value at all and as of the closing today (August 29th) the stock is up over 7%\n\nI’d expect such an incident to have negative effects on a company’s value, but this didn’t.", "Are these sorts of things usually just not big deals?", "If Apple were demonstrating their new iPhone’s amazing app that works perfectly and then it caused the phone to crash, would that negatively affect the value?", "Or is it basically all just about the money that the company brings in?", "—— \n\nThanks to everybody who answered nicely.", "I’ve gotten some explanations that make sense including:\n\n- Elon’s livestream video wasn’t of current autopilot software on Teslas, but rather a beta FSD which performed very well.", "- 44 million people probably didn’t actually see that moment where “human intervention” takes place.", "Plus the media blew it out of proportion.", "- Computer trading algorithms don’t care about these minute things.", "- This isn’t exclusive to Tesla.", "Similar things like this happening to other gigantic companies happen and they barely matter.", "- The market overall went up on the 29th and Tesla has a high beta.", "I’m sorry that my post was so offensive towards Tesla and the Saviour."]}, {"title": ["New Lyft CEO is requiring workers back to the office, “It’s going to be super fun .", ".", ".", "If you want to come in at six o’clock, that’s fine.”"], "text": ["https://finance.yahoo.com/amphtml/news/lyft-sliced-office-space-half-184650020.html\n\nWhen people first come in, **“we’re literally calling it homecoming,”** he said, adding that he hopes to re-create the feeling of the first day at a new school.", "**“We're going to give tours and have community groups [like book clubs] where people can get together and talk about things that have nothing to do with work.”**"]}, {"title": ["What’s the point of this sub if the top voted comment on every post is “Buy VOO”"], "text": ["This is r/stocks, there’s a different (and better) sub for investing.", "I understand the desire to be par with the market, especially after many people got blown out in 2022.", "But there ARE people who are good at picking stocks, and it’s NOT that hard, and people should be trying to learn from them, not settle for a market return.", "There was a great post of DD here a few weeks ago on Duolingo, with an investment thesis and a discounted cash flow model.", "The stock is up 20% since that post.", "That kind of post should be encouraged.", "I pick my own stocks.", "I have winners and losers.", "I learn from each, and each makes me a better trader and investor.", "I devote a few hours a week to research, and an hour or so each morning making any trading decisions.", "I won’t deny that there are many people who don’t have the time or brainpower to devote to researching individual companies, listening to earnings calls, and keeping up with evaluating them over time.", "For those, buying an ETF and investing passively is the way to go.", "My understanding is that that is not what this sub is for.", "So let’s stop wasting space with the “buy and hold your S&P ETF” bandwagon.", "Thanks."]}, {"title": ["HHS recommends rescheduling cannabis to schedule 3, causing cannabis stocks to rally"], "text": ["[https://www.marketwatch.com/story/u-s-dept-of-health-and-human-services-recommends-re-scheduling-cannabis-as-stocks-in-the-sector-rally-eea26685](https://www.marketwatch.com/story/u-s-dept-of-health-and-human-services-recommends-re-scheduling-cannabis-as-stocks-in-the-sector-rally-eea26685)\n\n[https://www.marijuanamoment.net/top-federal-health-agency-says-marijuana-should-be-moved-to-schedule-iii-in-historic-recommendation-to-dea/](https://www.marijuanamoment.net/top-federal-health-agency-says-marijuana-should-be-moved-to-schedule-iii-in-historic-recommendation-to-dea/)\n\n>The U.S. Department of Health and Human Services (HHS) is officially recommending that marijuana be moved from Schedule I to Schedule III under federal law—a historic development that means the top health agency no longer considers cannabis to be a drug with high abuse potential and no medical value.", ">  \n>After completing a scientific review into cannabis under a directive from President Joe Biden last year, HHS is now telling the Drug Enforcement Administration (DEA) that it believes marijuana should be placed in Schedule III of the Controlled Substances Act (CSA).", "The recommendation is not binding, and DEA has the final say, but the scientific analysis combined with growing political support for cannabis reform may well influence DEA to make the change.", "Nearly one year ago (October 2022), Biden tasked the AG and HHS to review cannabis' schedule on the controlled substances act.", "It has been long speculated that the intention of the Biden administration has been to reschedule cannabis shortly before the 2024 election.", "Over the past few months, rumors emerged that the federal government is targeting schedule 3 for cannabis.", "Today, we received confirmation of that intention as well as seeing another domino fall in the process to remove cannabis from schedule 1 status with the HHS officially recommending its move to schedule 3.", "Today's action is the most significant move on the federal level for cannabis reform since cannabis became schedule 1 back in 1970.", "The ball is now in the DEA's court.", "They typically respond to these review requests in \\~3 months, and rely on the scientific and medical research of federal agencies such as HHS for their decision making.", "This would set us up to see cannabis likely rescheduled in Q1 of 2024, lining up nicely with the election.", "This would have tremendous impact on the US cannabis companies which currently face regulatory hurdles that are unheard of in other sectors.", "These companies are paying 70-80% tax rates as they are unable to deduct normal business expenses due to 280E, which only applies to schedule 1 and 2 substances.", "Schedule 3 would eliminate this tax burden and make many of these companies profitable overnight.", "It would also remove hurdles in terms of access to the federal banking system and would ultimately allow these companies to uplist to the major US exchanges such as the NASDAQ and NYSE.", "Currently these stocks trade on the CSE, a small Canadian stock exchange that is heavily manipulated and illiquid.", "MSOS, the US-only cannabis stock ETF, is up over 20% today on this news."]}, {"title": ["Billionaire at 34, Then $1.75: The Michael Saylor Story You've Never Heard Of"], "text": ["Imagine this: You're the CEO of a public company, and those dreaded quarterly reports are just around the corner.", "But here's the catch — your company's revenue isn't looking so hot.", "Panic mode sets in!", "☠\n\nWhat do you do?", "You need extra revenue, and you need it fast!", "So, you come up with a \"brilliant\" idea.", "💡\n\nYou find a partner, you invest in them, and in return, they magically **\"buy\"** your product.", "Voilà!", "You've got revenue, albeit a bit inflated.", "This nifty maneuver is what we call a **\"boomerang\" transaction**, and it fits the name perfectly, right?", "Enter Michael Saylor, the current Bitcoin hero, was the unsung hero of the early 2000s internet boom.", "Many of you may not know but, he ran a tech company that soared to the heavens with a massively successful IPO, making him a billionaire at just 34.", "But here's the **twist**:\n\nBehind the scenes, the quarterly and annual reports were like a magician's trick, filled with carefully crafted financial shenanigans like the \"boomerang\" transactions, **made just before the period** ended.", "As long as there was no Sherlock Holmes-level auditing, Michael Saylor was living the American dream to the max!", "But then came Forbes (yes, they were lit back then).", "They dropped the bomb, and PwC audited everything, exposing the grand scheme.", "Michael called it \"material accounting irregularities,\" but the market wasn't feeling generous.", "In a single day, the share price nosedived by a jaw-dropping 60%, and it finally hit rock bottom at $1.75.", "Ouch!", "Now, we're left wondering whether Michael Saylor is still pulling these shenanigans.", "Only time will spill the beans.", "**Moral** of the story, my fellow investors: Don't underestimate those SEC filing reports like 10K and 8K's, even if they're a tad bit boring, especially the footnotes and understand their revenue recognition practices.", "Your hard-earned money deserves nothing less!", "💼💰  \n\n\nEdit: In no way I am saying all boomerang transactions are suspicious and fraudulent, but it becomes a problem if it is a key driver of revenue growth for a company, as was the case with MSTR."]}, {"title": ["China’s Evergrande files for Chapter 15 bankruptcy"], "text": ["China Evergrande Group ￼ has sought Chapter 15 bankruptcy protection in New York courts, according to reports Thursday.", "The developer earlier this month reported narrowing losses for 2022 as it reined in costs.", "Evergrande defaulted in late 2021.", "In recent sessions, investors have worried about another troubled Chinese developer, Country Garden  Holdings, whose bonds were downgraded to deteriorating from stable by research company GimmeCredit on Wednesday."]}, {"title": ["Evergrande loses $2 bln in value as trade resumes; extends creditor voting"], "text": ["China Evergrande Group lost $2.2 billion, or 79% of its market value, on Monday after its shares resumed trading in a crucial step for the world's most indebted property firm to restructure its offshore debt.", "Evergrande is at the centre of a crisis in China's property sector that has seen a string of debt defaults since late 2021, and its stock has been suspended for 17 months.", "The developer, which is in the process of getting approvals from creditors and the courts to implement the debt restructuring plan, said on Monday it would postpone by a month meetings for these creditors to vote on the proposal to give more time \"to maximise creditor engagement and support informed-decision making\".", "The scheme meetings will now take place on Sept 26, instead of Monday, but three people with direct knowledge of the matter said many creditors had already registered their vote by a deadline last Wednesday to submit forms.", "Evergrande needs approval from more than 75% of the holders of each debt class to approve the plan, which offers creditors with a basket of options to swap debt for new bonds and equity-linked instruments backed by its stocks and those of its Hong Kong-listed units.", "Its Hong Kong listed shares closed down 79% to HK$0.35 on Monday.", "Market capitalisation shrank to HK$4.6 billion ($586.29 million) from HK$21.8 billion ($2.78 billion) from when it last traded.", "https://www.reuters.com/business/china-evergrande-shares-plunge-more-than-80-trade-resumes-after-17-months-2023-08-28/"]}, {"title": ["China plans to expand its ban on iPhones, AAPL drops 3%+"], "text": ["**China plans to expand a ban on the use of iPhones in sensitive departments** to government-backed agencies and state companies, a sign of growing challenges for Apple Inc. in its biggest foreign market and global production base.", "Several agencies have begun instructing staff not to bring their iPhones to work, people familiar with the matter said, affirming a previous report from the Wall Street Journal.", "In addition, **Beijing intends to extend that restriction far more broadly to a plethora of state-owned enterprises and other government-controlled organizations**, the people said, asking not to be identified discussing a sensitive matter.", "If Beijing goes ahead, **the unprecedented blockade will be the culmination of a yearslong effort to root out foreign technology use** in sensitive environments, coinciding with Beijing’s effort to reduce its reliance on American software and circuitry.", "It **threatens to erode Apple’s position in a market that yields about a fifth of its revenue**, and from where it makes the majority of the world’s iPhones through sprawling factories that employ millions of Chinese.", "Chinese state firms like oil giant PetroChina Co. employ millions and control vast swathes of a centrally planned economy.", "Given Apple’s relationship with Beijing and its importance to the economy, it “has historically been viewed as relatively safe in China from government restrictions,” KeyBanc Capital Markets analyst Brandon Nispel said in a report Wednesday.", "“Is the government changing its stance?”\n\nA representative for Cupertino, California-based Apple didn’t respond to a request for comment.", "The State-Owned Assets Supervision and Administration Commission and the State Council Information Office didn’t respond to faxed requests for comment.", "Source: [https://archive.ph/DOwGO#selection-5555.0-6051.108](https://archive.ph/DOwGO#selection-5555.0-6051.108)"]}, {"title": ["Disney finishes today’s session at lowest price since 2014"], "text": ["Disney finished the session near $82.50.", "The lowest recorded price since 2014.", "Disney reported a heightened PE last quarter due to a charge taken to reduce streaming contracts and other agreements.", "Ultimately, this should show better earnings in future quarters as it’s a one time charge.", "Disney plus is nearing profitability as it narrowed streaming losses as reported on the last earnings call."]}, {"title": ["Chinese developer Country Garden reports $6.7bn loss amid fears of another Evergrande"], "text": ["https://www.theguardian.com/world/2023/aug/31/country-garden-chinese-property-developer-reports-half-year-finanical-loss-fears-default-risk\n\nEmbattled Chinese developer Country Garden reported a 48.9bn yuan ($6.7bn) loss for the first half of the year in a stock exchange filing on Wednesday, adding to worries of a potentially catastrophic default.", "Its tenuous state has sparked fears of a collapse that could have far-reaching consequences for the Chinese financial system two years after the fall of Evergrande."]}, {"title": ["Jelly giant J.M.", "Smucker agrees to buy Twinkie maker Hostess Brands for $5.6 billion"], "text": ["https://www.cnbc.com/2023/09/11/jelly-giant-jm-smucker-agrees-to-buy-twinkie-maker-hostess-brands-for-5point6-billion.html\n\n>Jelly maker J.M.", "Smucker is buying Twinkie owner Hostess Brands for $5.6 billion, or $34.25 a share.", "Hostess shareholders will receive $30 in cash and .03002 shares of Smucker’s stock for each share of Hostess that they owned.", "Smucker has also agreed to assume Hostess’s debt.", "The deal is expected to close in Smucker’s fiscal third quarter, which ends in January.", "As of Friday’s close, shares of Hostess stock have risen 25% this year, giving the company a market value of $3.73 billion.", "But the company’s shares had already received a significant boost after Reuters reported in late August that it was considering a sale after fielding interest from large food companies, including PepsiCo and Oreo maker Mondelez International.", ">Hostess saw demand for its Twinkies and Ding Dongs slip after raising prices to mitigate higher commodity costs, sparking investor concern and takeover interest from larger rivals.", "For the full year, the company is anticipating that its volume will decline.", "Executives paused price hikes.", "Its sale to Smucker ends Hostess’s seven-year streak as an independent, publicly traded company.", "Hostess went public through a merger with a special purpose acquisition company in 2016.", "Smucker ticker is SJM.", "And Twinkies ticker is TWNK."]}, {"title": ["AMC shares slide more than 30% after theater chain announces plan to sell additional stock - CNBC.com"], "text": ["Link: https://www.cnbc.com/2023/09/06/amc-shares-fall-as-it-announces-plan-to-sell-additional-stock.html\n\nShares of AMC Entertainment fell sharply on Wednesday after the theater chain said in a filing that it plans to sell up to 40 million new shares to raise cash.", "The stock dropped 36.8%, bringing it to $8.62 per share.", "On a split-adjusted basis, that is AMC’s lowest close on record, according to FactSet.", "AMC was widely expected to sell additional shares after the successful conversion of the preferred APE shares into AMC common stock in August.", "It followed the settlement of a lawsuit objecting to the move.", "The theater chain sold millions of shares of common stock in recent years after becoming one of the so-called meme stocks popular with retail traders.", "The sales helped AMC stabilize itself after the Covid pandemic effectively halted the theatrical movie business.", "However, AMC used up its allotment of stock and needed shareholder approval to issue more.", "The company issued the preferred APE shares as part of a strategy to change its corporate voting structure and get shareholder approval to sell additional common stock.", "AMC said in the filing Wednesday that it will sell the new shares through “at-the-market” offerings, without a specific time frame.", "Citigroup, Barclays, B. Riley Securities and Goldman Sachs are listed as sales agents in the filing.", "The U.S. movie business remains below pre-pandemic levels, and the ongoing strikes in Hollywood have clouded the release slate for the rest of 2023 and 2024.", "AMC and pop star Taylor Swift announced last week that the theater chain is serving as the distributor for a concert movie of The Eras Tour to be released in October."]}, {"title": ["$7.6 trillion of US government debt will mature in the next year.", "31% of all outstanding US government debt, adding upward pressure on rates"], "text": ["https://finance.yahoo.com/news/7-6-trillion-us-government-040643412.html\n\nNearly a third of all outstanding US government debt is set to mature in the next 12 months, according to an analysis from asset management firm Apollo.", "A chart from Chief Economist Torsten Sløk shows that the share of US public debt set to mature in a year or less has steadily risen toward pandemic-era levels and is now at 31%.", "In terms of dollar amount, that's $7.6 trillion, a high not seen since early 2021.", "In addition, public debt maturing in the near term accounts for more than a quarter of US GDP.", "However, this is below its 2020 peak, when it made up a significantly larger share.", "Still, Sløk said the $7.6 trillion coming due is one source of upward pressure on US rates.", "The estimate comes as federal deficits have exploded in recent years, sharply elevating the trajectory of US debt.", "The Treasury Department has already auctioned $1 trillion in bonds just within this quarter.", "Meanwhile, borrowing costs have soared in the last year and a half as the Federal Reserve embarked on an aggressive tightening campaign, raising the government's debt-servicing costs.", "As of Friday afternoon, the 10-year Treasury yield stood at 4.25%, and three-month yield was 5.47%.", "Rates have also been under pressure from the Fed's quantitative tightening program, which removed a top buyer from the bond market."]}, {"title": ["Payrolls rose by 187,000 in August, unemployment rate rises to 3.8%"], "text": ["https://www.cnbc.com/2023/09/01/jobs-report-august-2023.html\n\nThe U.S. added more jobs than expected in August, a sign of resilience for a labor market under pressure from Federal Reserve interest rate hikes.", "Nonfarm payrolls grew by a seasonally adjusted 187,000 for the month, above the estimate for 170,000, the U.S. Bureau of Labor Statistics reported Friday.", "However, the unemployment rate was 3.8%, up significantly from July and the highest since February 2022.", "That increase came as the labor force participation rate increased to 62.8%, the highest since February 2020, just before the Covid pandemic declaration.", "Average hourly earnings increased 0.2% for the month and 4.3% from a year ago.", "Both were below respective forecasts of 0.3% and 4.4%."]}, {"title": ["Macy's sounding alarm on credit card debt"], "text": ["[https://www.cnn.com/2023/08/23/business/credit-card-debt-macys/index.html](https://www.cnn.com/2023/08/23/business/credit-card-debt-macys/index.html)\n\n“The speed at which the increase occurred for us and the broader credit card industry…was faster than planned,” Adrian Mitchell, Macy’s chief operating officer and chief financial officer, told analysts during an earnings call on Tuesday, adding that this problem “accelerated” in June and July.", "unbelievable.", "like, everytime you go to macys, they push down another credit card down your neck.", "even if you tell them you have two already.", "these companies are literally earning 30%+ of their profit from the high interest rates charged to customers.", "and equally crazy are the customers that pay this much interest on stuff that macy's sells - hardly anything comes under basic necessity.", "this article from 2017 called out the exact problem -  \n[https://www.nytimes.com/2017/05/11/business/dealbook/retailer-credit-cards-macys-losses.html](https://www.nytimes.com/2017/05/11/business/dealbook/retailer-credit-cards-macys-losses.html)\n\n  \n\"At Macy’s, the money from branded credit cards accounted for 39 percent of the company’s total profit of $1.9 billion last year, up from 26 percent in 2013, according to an analysis by Morgan Stanley\"\n\n  \nthis was back in 2017 itself."]}, {"title": ["Can anyone explain the theory that \"they\" (market makers/hedge funds/whoever) push a price down to avoid having to pay out for call options?"], "text": ["I heard a commentor somewhere mention it in passing, but they didn't explain it in detail.", "They hypothesized that people would have calls on NVDA which went up a lot in the after hours last night, but that today \"they\" (market makers/hedge funds/someone?)", "would push the price down to avoid having to pay out for those calls.", "Can someone explain this in more depth?", "Also, can someone who actually worked in an institution/hedge fund/market maker verify whether they ACTUALLY do this?", "It sounds very odd, is it illegal?", "It also seems dangerous because if they think a stock should go up, and they force the price down by SELLING TONS OF SHARES, it seems like a risky gamble because what if it doesn't work and now they have even less shares.", "I feel like when this idea gets brought up, it's always by people who have no experience working in the industry, so how would they actually know it happens?", "What if it's just a conspiracy like \"oh the bad guys came and pushed down the price of my stock and that's why I lost money\".", "Does anyone have links to interviews or youtube videos where industry people actually say this really happens?", "(No offense but if a person has never worked in the industry, how would they know that this kind of stuff happens?", "It would be like trusting a person with no military experience to tell you about secret strategies only people deep in the military would know)"]}, {"title": ["Shawn Fain and the UAW are Demanding a Min Wage Increase of 36%"], "text": ["Additionally, a 32 hour work week and more.", "The best offer is 20%.", "Automakers can give minimum effort for optics, but at the end of the day, they would want to follow the way of Tesla.", "Automakers need to find a way to lower the cost of production in order to scale up and be competitive with Tesla and Chinese companies.", "UAW will start their strike at midnight if they are unable to compromise.", "https://www.cnbc.com/2023/09/14/uaw-strikes-everything-you-need-to-know.html"]}, {"title": ["Oil Reaches New 2023 High on likelihood that Saudi Arabia or Russia will extend cuts"], "text": ["The per barrel price for the WTI grade of crude oil reached $85 on Friday—the highest price point yet this year as falling inventory levels spook the market.", "WTI crude oil briefly reached $85 per barrel before sagging to $84.90 around 10:00 a.m.", "ET.", "The last time WTI traded at a level that high was November 2022.", "For the day, WTI was trading up $1.33 per barrel, or 1.59%.", "Brent crude oil was also trading up on the day, by $1.05 per barrel, or 1.21%, at $87.88—also a new 2023 record.", "A big factor in the rising price of crude oil are the falling inventories in the United States, which dipped another 10.6 million barrels according to the Energy Information Administration for the week ending August 25.", "Another contributing factor to strong oil prices is the OPEC+ alliance, which includes heavyweights Saudi Arabia and Russia.", "The duo has reached a deal concerning production cuts, for which Russia has said it will provide details next week.", "The market is weighing the likelihood that Saudi Arabia or Russia could extend or deepen their current production cuts.", "More analysts than not expect that Saudi Arabia will extend its 1 million bpd production cut into October.", "A third support under oil prices is the weakening dollar, which makes crude oil more affordable for non-dollar holders, thereby stimulating demand.", "The price rise will make it more difficult for the Biden Administration to continue the painstakingly slow process of refilling the nation’s Strategic Petroleum Reserve, which has grown by an average of 600,000 barrels per week for the last few weeks, after draining 300 million barrels out of the SPR over the last few years.", "Despite the 300 million barrels leaving the SPR and going into commercial inventories, crude oil inventories—excluding that in the SPR—are more than 100 million barrels shy of July 2020 levels.", "https://oilprice.com/Energy/Crude-Oil/Oil-Reaches-New-2023-High.html"]}, {"title": ["Intel claims on track to regain foundry leadership from TSMC in 2025, secures \"large customer\" for 18A node tech"], "text": ["https://www.notebookcheck.net/Intel-claims-on-track-to-regain-foundry-leadership-from-TSMC-in-2025-secures-large-customer-for-18A-node-tech.745986.0.html\n\n\"To achieve this, Gelsinger told the conference that Intel is on track with its manufacturing roadmap of 5 nodes in four years, regaining process leadership in 2025 with the 18A node, as reported by Creative Strategies analyst Ben Bajarin.", "Gelsinger added that following on from Meteor Lake (expected to be launched later this month), Intel will be ramping its Intel 3 process (5 nm) “soon”.", "Perhaps more excitingly – and tantalizingly – Gelsinger said that Intel has received a large customer pre-payment for its 18A node (1.8 nm) that has already been successfully taped out and is on track for 2025.", "One can only speculate as to which company this “large customer” is.", "TSMC also claims it is on track for its own 2 nm process node in 2025 and already enjoys the patronage of major customers including Qualcomm, Nvidia, AMD, MediaTek along with Apple.", "Undoubtedly, Intel will be keen to secure at least one of these companies as it helps with its own economies of scale as investing in each of these new process nodes is a multi-billion-dollar endeavor.", "In the end, the competition in the foundry sector is great for customers as it is driving the delivery of faster, but also more efficient chips.\""]}, {"title": ["A worldwide lithium shortage could come as soon as 2025"], "text": ["The world could face a shortage for lithium as demand for the metal ramps up, with some analysts forecasting that it could come as soon as 2025.", "Others, however, see a longer time frame before that shortfall hits.", "BMI, a Fitch Solutions research unit, was among those that predict a lithium supply deficit by 2025.", "In a recently published report, BMI largely attributed the deficit to China’s lithium demand exceeding that of its supply.", "“We expect an average of 20.4% year-on-year annual growth for China’s lithium demand for EVs alone over 2023-2032,” the report stated.", "In contrast, China’s lithium supply will only grow 6% over the same period, BMI said, adding that rate cannot satiate even one third of forecasted demand.", "China is the world’s third largest producer of lithium, which is an integral element in electric vehicle batteries.", "The world produced 540,000 metric tons of lithium in 2021, and by 2030 the World Economic Forum projects that global demand will reach over 3 million metric tons.", "https://www.cnbc.com/2023/08/29/a-worldwide-lithium-shortage-could-come-as-soon-as-2025.html"]}, {"title": ["CVS stock falls after Blue Shield of California drops pharmacy as benefit manager"], "text": ["Shares of CVS Health (CVS) are falling after the Blue Shield of California dropped the pharmacy as its benefit manager for drug prices and other services.", "The Blue Shield of California is reportedly pursuing partnerships with Amazon Pharmacy (AMZN) and billionaire Mark Cuban's Cost Plus Drugs.", "Yahoo Finance's Julie Hyman and Brad Smith monitor CVS' stock action and comment on the environment for health service providers.", "https://finance.yahoo.com/video/cvs-stock-falls-blue-shield-140855161.html"]}, {"title": ["WSJ - Europe’s biggest economy is sliding into stagnation, and a weakening political system is struggling to find an answer."], "text": ["https://www.wsj.com/world/europe/germany-is-losing-its-mojo-finding-it-again-wont-be-easy-c4b46761\n\n>*Germany Is Losing Its Mojo.", "Finding It Again Won’t Be Easy.", "*\n\n>*BERLIN—Two decades ago, Germany revived its moribund economy and became a manufacturing powerhouse of an era of globalization.", "*\n\n>*Times changed.", "Germany didn’t keep up.", "Now Europe’s biggest economy has to reinvent itself again.", "But its fractured political class is struggling to find answers to a dizzying conjunction of long-term headaches and short-term crises, leading to a growing sense of malaise.", "*\n\n>*Germany will be the world’s only major economy to contract in 2023, with even sanctioned Russia experiencing growth, according to the International Monetary Fund.", "*\n\nGermany’s reliance on manufacturing and world trade has made it particularly vulnerable to recent global turbulence: supply-chain disruptions during the Covid-19 pandemic, surging energy prices after Russia invaded Ukraine, and the rise in inflation and interest rates that have led to a global slowdown.", "At Germany’s biggest carmaker Volkswagen, top executives shared a dire assessment on an internal conference call in July, according to people familiar with the event.", "Exploding costs, falling demand and new rivals such as Tesla and Chinese electric-car makers are making for a “perfect storm,” a divisional chief told his colleagues, adding: “The roof is on fire.”\n\nThe problems aren’t new.", "Germany’s manufacturing output and its gross domestic product have stagnated since 2018, suggesting that its long-successful model has lost its mojo.", "China was for years a major driver of Germany’s export boom.", "A rapidly industrializing China bought up all the capital goods that Germany could make.", "But China’s investment-heavy growth model has been approaching its limits for years.", "Growth and demand for imports have faltered.", "Instead of Germany’s best customers, Chinese industries have become aggressive competitors.", "Upstart Chinese carmakers are competing with German incumbents such as VW that are lagging in the electric-vehicle revolution.", "More broadly, the world has become less favorable to the kind of open trade that benefited Germany.", "The shift was expressed most clearly in then-President Donald Trump imposing tariffs not only on imports from China but also those of U.S. allies in Europe.", "The U.K.’s 2016 decision to leave the European Union and Russia’s annexation of Crimea in 2014, leading to EU sanctions, also signaled a shift toward a more hostile environment for big exporters.", "Germany’s long industrial boom led to complacency about its domestic weaknesses, from an aging labor force to sclerotic services sectors and mounting bureaucracy.", "The country was doing better at supporting old industries such as cars, machinery and chemicals than at fostering new ones, such as digital technology.", "Germany’s only major software company, SAP, was founded in 1975.", "Years of skimping on public investment have led to fraying infrastructure, an increasingly mediocre education system and poor high-speed internet and mobile-phone connectivity compared with other advanced economies.", "Germany’s once-efficient trains have become a byword for lateness.", "The public administration’s continued reliance on fax machines became a national joke.", "Even the national soccer teams are being routinely beaten.", "“We’ve kind of slept through a decade or so of challenges,” said Moritz Schularick, president of the Kiel Institute for the World Economy.", "In March, one of Germany’s most storied companies, multinational industrial-gas group Linde, delisted from the Frankfurt Stock Exchange in favor of maintaining a sole listing on the New York Stock Exchange.", "The decision was driven in part by the growing burden of financial regulation in Germany.", "But also, Linde, whose roots go back to 1879, said it no longer wanted to be perceived just as German—an association that it believed was depressing its appeal to investors.", "Germany today is in the midst of another cycle of success, stagnation and pressure for reforms, said Josef Joffe, a longtime newspaper publisher and a fellow at Stanford University.", "“Germany will bounce back, but it suffers from two longer-term ailments: above all its failure to transform an old-industry system into a knowledge economy, and an irrational energy policy,” Joffe said.", "“I think it’s important to remember that Germany is still a global leader,” German Finance Minister Christian Lindner said in an interview.", "“We’re the world’s fourth-largest economy.", "We have the economic know-how and I’m proud of our skilled workforce.", "But at the moment, we are not as competitive as we could be,” he said.", "Germany still has many strengths.", "Its deep reservoir of technical and engineering know-how and its specialty in capital goods still put it in a position to profit from future growth in many emerging economies.", "Its labor-market reforms have greatly improved the share of the population that has a job.", "The national debt is lower than that of most of its peers and financial markets view its bonds as among the world’s safest assets.", "The country’s challenges now are less severe than they were in the 1990s, after German reunification, said Holger Schmieding, economist at Berenberg Bank in Hamburg.", "Back then, Germany was struggling with the massive costs of integrating the former Communist east.", "Rising global competition and rigid labor laws were contributing to high unemployment.", "Spending on social benefits ballooned.", "Too many people depended on welfare, while too few workers paid for it.", "German reliance on manufacturing was seen as old-fashioned at a time when other countries were betting on e-commerce and financial services.", "After a period of national angst, then-Chancellor Gerhard Schröder pared back welfare entitlements, deregulated parts of the labor market and pressured the unemployed to take available jobs.", "The controversial reforms split Schröder’s Social Democrats, and he fell from power.", "Private-sector changes were as important as government measures.", "German companies cooperated with employees to make working practices more flexible.", "Unions agreed to forgo pay raises in return for keeping factories and jobs in Germany.", "Germany Inc. grew leaner.", "Meanwhile, the world was demanding more of what Germans were good at making, including capital goods and luxury cars.", "China’s sweeping investments in industrial capacity powered the sales of machine-tool makers in Bavaria and Baden-Württemberg.", "VW invested heavily in China, tapping newly affluent consumers’ appetite for German cars.", "Schröder’s successor, longtime Chancellor Angela Merkel, presided over years of growth with little pressure for further unpopular overhauls.", "Booming exports to developing countries helped Germany bounce back from the 2008 global financial crisis better than many other Western countries.", "Complacency crept in.", "Service sectors, which made up the bulk of gross domestic product and jobs, were less dynamic than export-oriented manufacturers.", "Wage restraint sapped consumer demand.", "German companies saved rather than invested much of their profits.", "Successful exporters became reluctant to change.", "German suppliers of automotive components were so confident of their strength that many dismissed warnings that electric vehicles would soon challenge the internal combustion engine.", "After failing to invest in batteries and other technology for new-generation cars, many now find themselves overtaken by Chinese upstarts.", "A recent study by PwC found that German auto suppliers, partly through reluctance to change, have suffered a loss of global market share since 2019 as big as their gains in the previous two decades.", "More German businesses are complaining of the growing density of red tape.", "BioNTech, a lauded biotech firm that developed the Covid-19 vaccine produced in partnership with Pfizer, recently decided to move some research and clinical-trial activities to the U.K. because of Germany’s restrictive rules on data protection.", "German privacy laws made it impossible to run key studies for cancer cures, BioNTech’s co-founder Ugur Sahin said recently.", "German approvals processes for new treatments, which were accelerated during the pandemic, have reverted to their sluggish pace, he said.", "Germany ought to be among the nations winning from advances in medical science, said Hans Georg Näder, chairman of Ottobock, a leading maker of high-tech artificial limbs.", "Instead, operating in Germany is getting evermore difficult thanks to new regulations, he said.", "One recent law required all German manufacturers to vouch for the environment, legal and ethical credentials of every component’s supplier, requiring even smaller companies to perform due diligence on many foreign firms, often based overseas, such as in China.", "Näder said his company must now scrutinize thousands of business partners, from software developers to makers of tiny metal screws, to comply with regulation.", "Ottobock decided to open its latest factory in Bulgaria instead of Germany.", "Energy costs are posing an existential challenge to sectors such as chemicals.", "Russia’s war on Ukraine has exposed Germany’s costly bet on Russian gas to help fill a gap left by the decision to shut down nuclear power plants.", "German politicians dismissed warnings that Russian President Vladimir Putin used gas for geopolitical leverage, saying Moscow had always been a reliable supplier.", "After Putin invaded Ukraine, he throttled gas deliveries to Germany in an attempt to deter European support for Kyiv.", "Energy prices in Europe have declined from last year’s peak as EU countries scrambled to replace Russian gas, but German industry still faces higher costs than competitors in the U.S. and Asia.", "German executives’ other complaints include a lack of skilled workers, complex immigration rules that make it hard to bring qualified workers from abroad and spotty telecommunications and digital infrastructure.", "“Our home market fills us with more and more concern,” Martin Brudermüller, chief executive of chemicals giant BASF, said at his annual shareholders’ meeting in April.", "“Profitability is no longer anywhere near where it should be,” he said.", "One problem Germany can’t fix quickly is demographics.", "A shrinking labor force has left an estimated two million jobs unfilled.", "Some 43% of German businesses are struggling to find workers, with the average time for hiring someone approaching six months.", "Germany’s fragmented political landscape makes it harder to enact far-reaching changes like the country did 20 years ago.", "In common with much of Europe, established center-right and center-left parties have lost their electoral dominance.", "The number of parties in Germany’s parliament has risen steadily.", "Chancellor Olaf Scholz and his Social Democrats lead an unwieldy governing coalition whose members often have diametrically opposed views on the way forward.", "The Free Democrats want to cut taxes, while the Greens would like to raise them.", "Left-leaning ministers want to greatly raise public investment spending, financed by borrowing if needed, but finance chief Lindner rejects that.", "“We need fiscal prudence,” Lindner said.", "Senior government members accept the need to cut red tape, as well as for an overhaul of Germany’s energy supply and infrastructure.", "But party differences often hold up even modest changes.", "This month the Greens lifted a veto of Lindner’s proposal to reduce business taxes only after they extracted consent for more welfare spending.", "As part of the deal, the government agreed to pass another law drafted by one of Lindner’s allies, Justice Minister Marco Buschmann, to trim regulation for businesses.", "Scholz recently rejected gloomy predictions about Germany.", "Changes are needed but not a fundamental overhaul of the export-led model that has served Germany well throughout the post-World War II era, he said in an interview on national TV recently.", "He cited the inflow of foreign investment into the microchips sector by companies such as Intel, helped by generous government subsidies.", "Scholz said planned changes to immigration rules, including making it easier to qualify for German citizenship, would help attract more skilled workers.", "But Scholz has struggled to stop the infighting in his coalition.", "The government’s approval ratings have tanked, and the far-right populist Alternative for Germany party has overtaken Scholz’s Social Democrats in opinion polls.", "“The country is being led by a bunch of Keystone Kops, a motley coalition that can’t get its act together,” Joffe said."]}, {"title": ["If I see any more technical analysis advice..."], "text": ["I'm going to lose my damn mind.", "Using patterns to trade is not a legitimate strategy for retail investors.", "Before someone says \"well if everyone believes the pattern it can be a self fulfilling proficy,\" please have some humility.", "Billy bob eyeballing a Robinhood chart and comparing it to a coffee mug is NO MATCH for MIT data scientists with fabulous data sets, institutional funding, and machine learning.", "Have some humility and just buy and hold.", "EDIT: To those who agree with me, I'm glad you see my perspective.", "To those who are resistant, I'm sure if blah blah crosses a blah blah range, it may break your resistance."]}, {"title": ["5 stocks to buy and hold for 10 years?"], "text": ["If you have to choose 5 stocks to buy and hold them for 10 years.", "What’s your choice?", "I will buy these 5 stocks for me: Microsoft, Amzn, Alphabet, Costco, Pepsi.", "You should choose 5 stocks not ETF\nIf you see more than 5 stocks, I appreciate it."]}, {"title": ["What happens if a large % of baby boomers take their 401k money out of the market?"], "text": ["realistically, especially in this challenging time, a significant % of the stock market will be liquidated to pay for retirement.", "Probably within a decade.", "Of course the money will be spend as well.", "So what scenarios do you see?"]}, {"title": ["Why are stocks going up on bad inflation data?", "!"], "text": ["CPI came in high at 3.7% today.", "Could lead to more rate hike and a recession.", "Why aren’t stocks going down?", "And why are bonds yields largely unchanged and almost heading down?", "Is today Opposite Day?"]}, {"title": ["Low-Income Struggles Amid Economic Slowdown: A Red Flag?"], "text": ["Bloomberg [has reported](https://www.bloomberg.com/news/articles/2023-08-30/poor-americans-tap-debt-buy-less-food-as-consumer-cracks-widen), citing a study by Propel Inc., that a growing number of low-income Americans are struggling to make ends meet—falling behind on rent and having difficulty affording food.", "This is happening even as inflation appears to be slowing down.", "These developments could indicate that the strategy of \"helicopter money,\" or pumping liquidity into the economy, is reaching its limits.", "The side effects, like inflation, are beginning to outweigh the benefits.", "Given this development, the Federal Reserve may face mounting political obstacles as it considers using monetary easing to address market and broader economic issues.", "Might it be that the markets are prematurely celebrating the recent cooling labor market and economic slowdown?"]}, {"title": ["Arm prices IPO at $51 per share, valuing company at over $54 billion"], "text": ["https://www.cnbc.com/amp/2023/09/13/arm-prices-ipo-at-51-per-share.html\n\n-Chip design company Arm priced its long-awaited initial public offering on Wednesday.", "-Masayoshi Son's SoftBank will own about 90% of the company after the offering.", "-Arm customers, including Apple, Google, Nvidia and Samsung, have said they will buy shares in the IPO.", "Who’s betting it will be up to $200 by Friday and go down to $70 by Tuesday?", "Then after a week or two no one will care."]}, {"title": ["In theory isn't the Stock Market undervalued when adjusted for inflation?"], "text": ["S&P 500 3 Year Return is at 40.29%\n\nInflation rate combined over the last 3 years 19.5%\n\n**Actual 3 year S&P return adjusted for inflation = \\~ 6.6% yearly**\n\nS&P average yearly return over last 20 years = **9.7%**\n\nImagine thinking you did well gaining in the past 3 years without considering inflation creaming your buying power"]}, {"title": ["“Temu is more dangerous than TikTok”"], "text": ["Grizzly research believes $PDD should fail.", "The business practice is unsustainable.", "They also stole user data on your phones.", "https://grizzlyreports.com/we-believe-pdd-is-a-dying-fraudulent-company-and-its-shopping-app-temu-is-cleverly-hidden-spyware-that-poses-an-urgent-security-threat-to-u-s-national-interests/"]}, {"title": ["China Cuts Stock Trade Tax half, Tightens IPOs to Boost Market"], "text": ["China lowered the stamp duty on stock trades for the first time since 2008 and pledged to slow the pace of initial public offerings, among a slew of new measures to woo investors back to its flagging equities market.", "The levy charged on stock trades will drop from 0.1% to 0.05% as of Aug. 28, the Ministry of Finance said in a statement Sunday, in a move to “invigorate capital markets and boost investor confidence.”\n\nThe China Securities Regulatory Commission cited “recent market conditions” as its rationale for slowing the pace of IPOs, without giving details on how it would do so.", "The CSRC also said restrictions will be set on the frequency and size of refinancing for companies which continuously report financial losses and whose stock prices have fallen below IPO levels or net asset levels.", "Property developers are exempted from the rule, it said.", "Authorities have been trying to dispel worries about the economy triggered by a slumping property market, trust defaults and weak consumer spending.", "Foreign investors sold mainland China stocks on a net basis for 13 consecutive sessions through Wednesday, the longest stretch ever, data compiled by Bloomberg show.", "“Stamp duty cut alone won’t make a difference to the Chinese stocks,” said Neo Wang, Evercore ISI’s New York-based managing director for China Research.", "“We expect a rally this week, maybe to a less degree than those after China lowered stamp duty in 2008.”\n\nChina last cut the stamp duty in April 2008, reducing it to 0.1% to support the market after a plunge, spurring a bull run the following year.", "The year prior, in May 2007, it raised the rate to 0.3% to cool a rally that was drawing more than 300,000 new investors a day.", "Wang added that a turnaround in the A-share market would not happen unless Beijing adopts more “bazooka” measures, such as the 4 trillion yuan stimulus package it rolled out in 2008.", "The CSI 300 Index has declined about 4% in 2023 after back-to-back annual losses and is underperforming a broader gauge of Asian equities by about six percentage points.", "Authorities this month urged pension funds, large banks and other big domestic financial institutions to increase stock investments to support the market.", "Regulators have also cut handling fees on stock transactions, prodded mutual fund managers to increase purchases of their own equity funds and encouraged companies to do more share buybacks.", "Other highlights of the measures announced by CSRC on Sunday:\n\n    Margin ratio for margin trading is lowered to 80% from 100%, effective from market closing on Sept. 8\n        Adjustment will apply to both new and existing contracts of margin trading\n    For companies with stock prices fallen below IPO levels or net asset levels, or which haven’t paid cash dividends or which are paying a total cash dividend lower than 30% of average net profit of the recent three years, the controlling share holders and de facto controlling holders will not be allowed to cut holdings in the secondary market\n\nhttps://www.bloomberg.com/news/articles/2023-08-27/china-cuts-tax-on-stock-trading-to-boost-market-confidence"]}, {"title": ["U.S. crude oil prices top $90 a barrel for the first time since November 2022"], "text": ["Oil prices jumped on Thursday, with U.S. crude topping $90 a barrel, as expectations of a tighter supply grew.", "West Texas Intermediate crude (WTI) gained 1.6% to $90.04 per barrel, hitting its highest level since November 2022.", "Brent crude was up 1.5%, at $93.23, reaching a 10-month high.", "Saudi Arabia and Russia have extended their oil output cuts to the end of 2023, and the move could result in a substantial market deficit for the rest of 2023, the International Energy Agency said on Wednesday.", "“From September onwards, the loss of OPEC+ production... will drive a significant supply shortfall through the fourth quarter,” the agency said in its monthly report.", "WTI crude is up almost 3% this week, on pace for the third straight weekly gain.", "Earlier this week, the OPEC issued updated forecasts of solid demand and also pointed to a 2023 supply deficit if production cuts remain.", "https://www.cnbc.com/2023/09/14/us-crude-oil-prices-top-90-a-barrel-for-the-first-time-since-november-2022.html"]}, {"title": ["How bad is the bankruptcy from Evergrande for the stockmarket?"], "text": ["Hi, there.", "I was wondering what the effects of the  bankruptcy of Evergrande is going to be on the stockmarket.", "Does anyone have an idea what the likely exposure is from western insitutions?", "What is China likely going to do?"]}, {"title": ["Massive Misconception About the Writers Strike"], "text": ["What most people do not realize is that the majority of the major studies are owned by larger entities that do not suffer from this.", "Sure its small term pain knowing that certain projects are on hold.", "There is a lot of content in the coffers that they can still continue to produce without additional writing.", "Most of the major studios also have other revenue streams that power them through.", "Let's just take Disney to start.", "They have $8.3B coming in from parks.", "They have $5.5B coming in from Streaming.", "They have 1.9 Billion coming in from cord deals.", "Look at Comcast, they have Peacock streamers, they have their existing cable business, they have their internet business (mixed with cable subscribers), they have their mobile unit.. they have plenty to keep powering their way through.", "Then you have weird companies like Apple and Amazon who can take virtual losses forever in entertainment and not care.", "Netflix is weird because of all its custom content but has a massive catalog of back content to keep subscribers happy for a while.", "&#x200B;\n\nWhat stocks to look at are the ones that rely only on content to stay alive.", "Those are the companies to be paying attention too.", "For instance I'd be very interested in how Warner Bro's/Discovery are going to be doing.", "I'd also look at Sony who owes a lot to their entertainment divisions for profits (sure they do electronics and niche other areas), but they own some of the larger studios.", "&#x200B;\n\nI also don't want to make this a political topic but the Writers guild really needs to re-think their leverage.", "Sure the major studio's wont have new content coming out and already put a massive backlog and delays to projects.", "The major studios now are conglomerates that own so many other businesses they can keep moving along.", "They also don't realize that these studios will keep generating revenue but don't have to pay any of the writers, actors, production, etc... they have a freeze on money coming in but also a freeze on money going out.", "The problem with industry consolidation + multi-faceted businesses is you lose your negotiating leverage.", "&#x200B;\n\nWould love to hear other peoples thoughts on this.", "What do you think?", "&#x200B;\n\nEspecially their fear of AI As they know will becoming after their jobs.", "Netflix already was using it to determine what  shows and themes would be the most productive for returns.", "Disney/ILM started using it to replace opening credits.", "Disney even hired the group that for the end of Mando Season 2 were Luke showed up, another group of people showed they could do a better Deep Fake and they hired them.", "If I'm not mistaken Netflix used AI to write one of black mirrors episodes.", "AI is coming and I can see why writers are so fearful.", "People are so naive on the idea that AI is coming for jobs even creative.", "&#x200B;\n\nIf anything I'd love to hear from people some of the VFX studios if they are public?", "That would be were I would start putting money into.", "Ones that are progressive and have a massive catalogue.", "It sucks ILM is private (Disney owned), Pixar (Disney Owned), Dreamworks, etc.", "&#x200B;\n\nI wish Epic which powers the majority of games but also the Volume that is used in almost all new TV productions.... was public but they are private for now.", "&#x200B;\n\n**At the end of the day the stocks to pay attention to are:**\n\nThe Chips Needed to Make these: Intel, Nvidia, AMD\n\nThe Fabs that produce them: TSCM, Samsung, Intel\n\nThen there are companies producing the software: Epic, Blender, Unity.", "Adobe\n\nThe Streaming Services: Netflix, Disney+, Max (Warner Bros) -- then you have youtube material being turned into its own streaming service like Curiositystream Inc.", "The Companies that specialize in building AI  Model with datasets: OpenAI (Microsoft), Google, Facebook, ByteDance, etc.", "Royalty Companies: Dolby, IMAX\n\n**Then there are the host of startups creating custom chips for these tasks (ASICS), newer software, and existing VFX studios who know how to power them all.", "Which is where the money will be for future stocks.", "**"]}, {"title": ["Disney - earnings discussion"], "text": ["DIS has made the decision to further up its streaming monetization efforts by adopting paid sharing starting in 2024, following NFLX's lead.", "These price increases come on top of those for Hulu and Disney+ Premium (ad-free) that will increase by 20% and 30%, respectively, starting in October 2023.", "While these initiatives may accelerate the company's top and bottom-line growth, it is still unclear whether they will be able to increase Disney+'s dwindling US streaming market share to 13% by Q2 of 23.", "Long-term, the well-diversified entertainment options provided by DIS, including ESPN and sports betting, across resorts, theme parks, cruises, and streaming, might be a real franchise flywheel.", "Able to set itself apart from rivals and preserve an alluring value proposition for clients.", "Disney and Apple have a number of intriguing partnerships for the Vision Pro spatial headset, which will feature Disney+ streaming video and immersive 4D gaming experiences.", "Although the headset won't be available until early 2024, the media company will probably benefit from its strong IP portfolio and increasingly varied revenue prospects.", "Netflix, unlike Disney, has not yet increased pricing, but it has also subtly discontinued the cheapest ad-free package, thereby increasing overall subscription and advertisement profits.", "Since more customers are likely to switch to ad-supported rates as a result of less discretionary spending, an elevated interest rate environment, and increased ad-free streaming plans, these moves are undoubtedly deliberate.", "However, Disney investors should also be aware of Disney+'s diminishing streaming market share in the US, which will drop to 13% by Q2 23 (a 5% decrease from December 2022 and a 2% YoY increase).", "The increased prices could likely result in more churn and market share losses, increasing the stock's volatility during the ensuing two quarters.", "https://www.cnbc.com/2023/08/09/disney-dis-earnings-report-q3-2023.html"]}, {"title": ["Nvidia Up 2% Premarket After HSBC Sets $780 Price Target"], "text": ["[https://tokenist.com/nvidia-up-2-premarket-after-hsbc-sets-780-price-target/](https://tokenist.com/nvidia-up-2-premarket-after-hsbc-sets-780-price-target/)  \n\n\nNvidia's stock gained 2% in premarket trade after HSBC analysts, including Frank Lee, raised the price target from $600 to $780 and maintained a Buy rating.", "They cited the ongoing AI boom as a key driver, expecting strong AI server momentum to surpass projections and continue outpacing supply.", "This trend is anticipated to persist through 2025, benefiting from a clearer understanding of US Cloud Service Providers' capital expenditures.", "The bullish outlook aligns with Nvidia's impressive 2023 growth, with its shares surging over 200% year-to-date.", "The success of AI solutions like ChatGPT has stimulated this growth and propelled Nvidia into the ranks of trillion-dollar companies, alongside Apple and Microsoft.", "Nvidia's upcoming fiscal Q2 2024 earnings report is highly anticipated after the company's optimistic guidance of $11 billion in revenue, a substantial leap from Wall Street's $7.15 billion estimate.", "The company's stock performance has solidified its position as the S&P 500's top performer this year."]}, {"title": ["Is there a company that doesn't yet make a profit (or revenues) that you have invested in with hopes of the future?"], "text": ["I thought of this as someone else commented about investing in Apple early would make you a multimillionaire today.", "Are you investing in any company today with similar hopes?", "I know some examples would be drug companies or maybe a startup EV company.", "I think many of these long shots are facing an uphill battle these days.", "Investors are moving to cash and bonds...but maybe now is the time to invest when others are afraid?", "Would be interesting to learn about some of these companies."]}, {"title": ["Trying to catch the falling DIS knife…"], "text": ["Down 40% lifetime on Disney stock at the moment, had been buying on the way up to $200ish and on the way back down but stopped at about $100 for an average of $139 per share.", "I know Disney has so many sources of income but if feels like the stock has just stalled in the middle of a lake and is stuck without a paddle.", "Between mid-level remakes, parks not hitting expectations this summer and no dividend on the stock, not really confident I’ll be getting my money back anytime soon.", "I’m in Disney for the long haul, but trying to figure out when the best time to add more is so I can start digging myself out of this 40% hole.", "I dont feel as if it will get to $60-70 range but its been still dripping toward $80 constantly.", "What do we think?", "Is this stock just toast or will it come back as time progresses?"]}, {"title": ["Why is Apple surging when China is in trouble?"], "text": ["Apple is up 5% this week, 1.6% today.", "Some say it's because it announced the date it will reveal the new iphone.", "But didn't the market already expect this to happen?", "Why is it surging now, especially given that:\n\n* Most experts don't think China's stimulus is going to dig itself out of the real estate bubble hole.", "* While we're not in a recession, consumer spending is slowing.", "* Apple has been relatively quiet in all the AI discussions.", "Some analysts think they are falling behind.", "I'm no hater.", "I hold Apple and I'm wondering if I should sell some covered calls to take advantage of this hype."]}, {"title": ["Jackson Hole takeaways.", "They're probably not cutting rates."], "text": ["-wants to maintain 2% inflation \n-acknowledges inflation has moved down from peak but remains too high\n-Prepared to raise rates \n-reiterates 2% target\n-Talks about \"uncertainties\"\n-Explains what happens when they tighten too little (2-3 sentence)\n-Explains what happens when they do too much (one Sentence)\n\nI don't think he's cutting rates because inflation ain't at 2% yet.", "Said they were prepared to raise rates.", "Talked about uncertainies.", "And talked quite a lot about what happens if they \"tighten too little\"."]}, {"title": ["Started investing in 2020…"], "text": ["I kept daytrading out of FOMO and I recently sold the rest of my lost long positions I got into stocks such as memes and the Chinese EV stocks now I’m down out 95% roughly 25k and I’m in my early 20s.", "Here’s the thing, I always thought I had good risk tolerance by dollar cost averaging, but it was instead just snowballing my losses, and I realized that, I can’t keep going.", "I finally learned a big lesson and left everything I had left  in ETFs and haven’t looked at the market in the longest time since 2020.", "But I’m taking big mental toll but im also relieved that im out.", "Any help how to handle it positively?", "I feel setback pretty hard ):"]}, {"title": ["Chip design firm Arm sets share price between $47 and $51 for blockbuster U.S. IPO"], "text": ["Only 9.4% of Arm’s shares will be freely traded on the New York Stock Exchange.", "Arm was previously dually listed in London and New York, before SoftBank acquired it for $32 billion in 2016.", "Thoughts?", "Chip design firm Arm sets share price between $47 and $51 for blockbuster U.S. IPO https://www.cnbc.com/2023/09/05/chip-design-firm-arm-sets-share-price-between-47-and-51-for-blockbuster-us-ipo.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard"]}, {"title": ["Chinese property developer Country Garden to be removed from Hang Seng Index on Sept. 4"], "text": ["This is the latest blow to China's embattled property sector, following news of property developer Evergrande filing for bankruptcy protection in the U.S. last week.", "[Shares of Country Garden](https://www.cnbc.com/2023/08/21/country-garden-to-be-removed-from-hang-seng-index-on-sept-4.html) have plunged over 70% so far this year, hitting record lows after the company failed to meet bond coupon payments, issued a profit warning and suspended trading in 11 of its onshore bonds.", "Country Garden also has less than 30 days to make coupon payments it missed on Aug. 7 on two dollar bond coupons worth $22.5 million."]}, {"title": ["Long Jim Cramer ETF Shutters After Luring in Just $1.3 Million"], "text": ["(Bloomberg) -- An exchange-traded fund that aimed to track CNBC anchor Jim Cramer’s stock picks is planning to shutter just five months after launching.", "The Long Cramer Tracker ETF (ticker LJIM) will stop trading Sept. 11, according to a press release Monday.", "The fund, which buys stocks recommended by the host of CNBC’s Mad Money show, has only managed to attract $1.3 million in assets amid gains of just 2.2% since its debut in March.", "Tuttle Capital Management chief executive Matt Tuttle launched LJIM alongside the $3.4 million Inverse Cramer Tracker ETF (SJIM), which bets against Cramer’s stock calls and will continue to trade.", "While LJIM has actually outperformed its bearish Cramer counterpart, Tuttle says he is shutting the fund after failing to attract the attention of the CNBC host.", "“We started LJIM in order to facilitate a conversation with Jim Cramer around his stock picks as the other side to the Short Cramer ETF,” Tuttle said in the press release.", "“Unfortunately, Mr. Cramer and CNBC have been unwilling to engage in dialogue and instead have chosen to ignore the funds, therefore there is no reason to keep the long side going.", "Going forward we will just focus on the short side.”\n\nA CNBC spokesperson didn’t immediately respond to a request for comment.", "Despite a slide in August, LJIM has gained about 2.2% on a total return basis since inception, with Nvidia Corp., Wells Fargo & Co. and Oracle Corp. among its biggest holdings.", "SJIM, which also short-sells Cramer’s picks in addition to buying companies he recommends against, has dropped 4.4% over that span.", "Tuttle told Bloomberg’s Trillions podcast in March that he and two colleagues monitor Cramer’s television appearances and social media accounts to put together the fund’s actively managed portfolios, which charge 1.2%.", "A CNBC spokesperson said at the time that Cramer encourages long-term investing through “a balanced portfolio that includes index funds and individual stocks.”\n\nTuttle is behind some of the $7.4 trillion ETF industry’s more infamous products.", "In addition to the Cramer funds, he’s also behind the $240 million AXS Short Innovation Daily ETF (SARK), which wagers against Cathie Wood’s flagship fund\n\nhttps://www.bnnbloomberg.ca/long-jim-cramer-etf-shutters-after-luring-in-just-1-3-million-1.1961839"]}, {"title": ["What is the most money you’ve ever made on a single trade, and what company was it?", "When did you buy it and at what price?…"], "text": ["When did you sell it and at what price?", "How many shares did you own?", "How did you decide to buy that particular company?", "How did you decide it was time to sell?", "Do you wish you’d done anything differently?", "What did you do with the money?", "Did you reinvest all of it?", "Did you just reinvest your profit?", "Or did you pull out completely?"]}, {"title": ["Warner Bros.", "Discovery Says Ongoing Strikes Will Mean $300M-$500M Hit to 2023 Earnings"], "text": ["https://www.hollywoodreporter.com/business/business-news/warner-bros-discovery-strikes-earnings-impact-2023-1235581943/\n\nWarner Bros.", "Discovery has lowered its 2023 adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) forecast to $10.5 billion to $11.0 billion, a hit of $300 million to $500 million, “predominantly due to the impact of the strikes,” compared with the previously targeted low end of the $11.0 billion to $11.5 billion range.", "In a regulatory filing Tuesday, the company — led by CEO David Zaslav, who has been very engaged in negotiating with Hollywood unions to end the work stoppage — didn’t detail when it expects the strikes could end, but updated its guidance that had previously assumed they would be resolved by early September, as management had mentioned during its second-quarter earnings conference call.", "Here is a detailed look at WBD’s revised full-year 2023 guidance: WBD’s filing said it was now “expecting lower adjusted EBITDA” for the full year in the range of $10.5 billion to $11 billion, “reflecting the company’s assumption that adjusted EBITDA will be negatively impacted by approximately $300 million-$500 million, predominantly due to the impact of the strikes.”  The company also raised its free cash flow expectations for the full year to at least $5 billion.", "“Further, the company now expects to exceed $1.7 billion in free cash flow for the third quarter of 2023, in part due to the strong performance of Barbie as well as incremental impact from strike-related factors,” the filing said.", "The company is maintaining its expectation of achieving net leverage below 4.0x by the end of 2023, though, as well as its target gross leverage range of 2.5x-3.0x by the end of 2024."]}, {"title": ["U.S. et al v. Google - US federal government sets sights on core search business that turned Google into a $1.7 trillion behemoth"], "text": ["The case centers on whether Google illegally cemented its dominance and squashed competition by paying Apple and other companies to make its internet search engine the default on the iPhone as well as on other devices and platforms.", "In legal filings, the Justice Department has argued that Google maintained a monopoly through such agreements, making it harder for consumers to use other search engines.", "Google has said that its deals with Apple and others were not exclusive and that consumers could alter the default settings on their devices to choose alternative search engines.", "Google has amassed 90 percent of the search engine market in the United States and 91 percent globally, according to Similarweb, a data analysis firm.", "Source: https://www.nytimes.com/2023/09/06/technology/modern-internet-first-monopoly-trial-us-google-dominance.html?smid=nytcore-ios-share&referringSource=articleShare"]}, {"title": ["Peloton shares drop 20% after posting wider-than-expected loss, falling sales due to Bike recall, seasonality"], "text": ["https://www.cnbc.com/2023/08/23/peloton-pton-earnings-q4-2023.html\n\n&#x200B;\n\nPeloton on Wednesday reported a wider-than-expected loss and a quarterly drop in new subscribers that it blamed on its recall of its Bike seat post and seasonality, sending shares plunging about 20%.", "The company fell short of analysts’ earnings estimates but beat sales expectations.", "Here’s how the fitness company did in its fourth fiscal quarter compared with what Wall Street was anticipating, based on a survey of analysts by Refinitiv:\n\nLoss per share: 68 cents vs. 38 cents expected\n\nRevenue: $642.1 million vs. $639.9 million expected\n\nThe company reported a net loss of $241.8 million, or 68 cents per share, for the three-month period that ended June 30, compared with a loss of $1.26 billion, or $3.72 a share, a year earlier.", "Sales dropped to $642.1 million, down $678.7 million a year earlier.", "The company’s fiscal fourth quarter, which falls during the summer months, is traditionally slow not just for Peloton but also for other fitness retailers.", "Consumers have a tendency to pull back on workouts during the season as they travel and take part in other summer plans.", "In May, CEO Barry McCarthy warned the fourth quarter would be among its most challenging from a growth perspective.", "For the first time, Peloton projected a decline in subscribers.", "It ended the quarter with 3.08 million subscribers, up 4% year over year and in line with the company’s expectations.", "But compared with last quarter, subscribers declined by 29,000.", "Peloton attributed the drop to a “seasonal” slowdown in hardware sales and higher-than-anticipated churn.", "“Peloton’s FYQ4 performance is a reminder we operate a seasonal business,” McCarthy wrote in a letter to shareholders.", "“The slowdown exceeded our expectations through May and through the first three weeks of June as consumer spending shifted toward travel and experiences,” he wrote.", "“Then eight weeks ago the trend reversed itself, and we began to see a reacceleration in hardware sales.”\n\nPeloton also believes the recall of its Bike seat post, which had a tendency to detach and break unexpectedly during use, created more churn than it expected.", "The metric stood at 1.4% for the quarter.", "The company suspects 15,000 to 20,000 people decided to pause their monthly subscriptions during the quarter while they waited for their seat post to be replaced.", "The recall, announced in May, impacted more than 2 million Bikes the company had sold since January 2018 and cost $40 million in the quarter, far more than Peloton expected, McCarthy said.", "To date, the company has received 750,000 requests for replacement seat posts, which is also more than it had anticipated.", "So far, Peloton has fulfilled 340,000 requests and expects to wrap up the rest by the end of September.", "Peloton narrowly reached positive free cash flow status on an adjusted basis, but doesn’t expect that will last during the next two quarters due to expected slowdowns in hardware sales, timing of inventory payments, marketing spending and the cash needed for the seat posts.", "However, it does expect to reach free cash flow positivity in the second half of fiscal 2024.", "In premarket trading, Peloton’s shares plunged about 30%, but they regained some ground after the market opened.", "McCarthy commented on the stock price during his call with analysts, saying there is “enormous disconnect between the stock price” and the work the company is doing to drive growth.", "“I don’t mean to sound like one of those CEOs who’s completely disconnected from the stock price, because it’s not lost on me,” said McCarthy.", "“But I have never been more optimistic, more excited about the future of the business.”\n\nStrategy changes on the path to growth McCarthy, a former Netflix and Spotify executive, has spent the last three months focusing on new strategies aimed at getting the fitness company back on a path to growth.", "The company has been working to capture customers who don’t have thousands of dollars to splurge on a stationary bike or treadmill by offering a rental program and a certified refurbished option.", "The rental service, which recently launched in Germany, now has more than 48,000 subscribers.", "The refurbished line brought in 6,500 sales during the quarter.", "Both are “proving to be important growth initiatives,” McCarthy told shareholders.", "Part of that strategy is the company’s rebrand under the guidance of its new Chief Marketing Officer Leslie Berland, a former Twitter (now known as X) executive.", "The retailer has positioned itself as a fitness company for all that is just as invested in its app as it is its pricey connected fitness products, such as its Bike, Tread and Row.", "In May, it unveiled a series of new pricing tiers for its fitness app that includes an unlimited free membership option (with no credit card required) and levels that cost $12.99 and $24 monthly.", "The app allows consumers to watch Peloton’s fitness classes and build their own workouts from wherever they are, including their gym.", "Since the relaunch, the company has clocked more than 900,000 app downloads, over two-thirds of which were non-Peloton members.", "It is also seeing more purchases of its higher-priced membership tier than it expected.", "It ended the quarter with 256,000 free monthly active users.", "“The anytime, anywhere, anyplace message is absolutely landing,” McCarthy said on a call with analysts.", "“The last objective \\[of the relaunch\\] was to remind people that, and particularly with the launch of the app, that it’s more than just a stationary bike company and that message is also finding traction.”\n\nPeloton is also seeing “meaningful positive shifts in perception across a range of measures” including gains among Gen Z consumers and others who may be older but still new to fitness.", "Peloton is also seeing a shift in the types of people who are downloading its app toward men, Gen Z, Black and Hispanic consumers.", "As part of the rebrand, Peloton is beginning to offer a variety of “limited edition bike frame colors and graphics to both the consumer and commercial markets,” McCarthy said.", "“For the last ten years Peloton has been the Henry Ford of stationary bikes.", "We sold any color bike frame you wanted as long as you wanted black,” he told shareholders.", "“I’m excited to announce a change in strategy.", "... Expect to hear more about this exciting initiative this fall.”\n\nPeloton has also been leaning into its business-to-business strategy to further drive revenue and capture new customers.", "Earlier this month, it announced the launch of Peloton for Business, which allows companies to offer access to the app and its connected fitness products through its benefits offerings.", "Clients include Volvo, which has Peloton bikes in its company fitness center and offers employees access to the Peloton app, its all-access membership and discounts on hardware, including the Bike, Bike+, Tread and Guide.", "Dropbox offers a similar package to its employees.", "Peloton also launched a new program aimed at partnering with NCAA Division 1 schools.", "The new strategy kicked off Tuesday with its announcement that it will be partnering with the University of Michigan to create co-branded Peloton bikes that will be used at the school’s various fitness facilities – and along the sidelines at the school’s football stadium, known as the Big House.", "“Expect to hear more announcements about additional global partners in the weeks ahead,” McCarthy said.", "It also launched a new discounted offering for college students of its “One” tier, which typically costs $12.99 a month but will be cut to $6.99 a month."]}, {"title": ["How is Dropbox still not being crushed by the competition?"], "text": ["Since google, Microsoft, apple, Amazon and slew of other huge companies and medium companies offering cloud consumer services, how is Dropbox like the little engine that could?", "The stock keeps rising.", "People still seem to use it and be happy with it, including myself, but how does it still stay up there?", "Does other services suck that much?", "Does Dropbox offer something others don’t?", "My guess is not trying to “get you” in their ecosystem but other apps offer bundled service etc.", "Is Dropbox still viable for the future or the mega tech will eventually knock Dropbox out?", "https://www.morningstar.com/stocks/dropbox-earnings-solid-revenue-margins-amid-tough-macroenvironment-maintain-valuation"]}, {"title": ["SAG-AFTRA Gears Up For Possible Strike Against Video Game Industry"], "text": ["https://deadline.com/2023/09/sag-aftra-possible-strike-video-game-companies-1235533458/\n\n>“Here we go again,” said SAG-AFTRA President Fran Drescher.", "“Now our Interactive Video Game Agreement is at a stalemate too.", "Once again we are facing employer greed and disrespect.", "Once again artificial intelligence is putting our members in jeopardy of reducing their opportunity to work.", "And once again, SAG-AFTRA is standing up to tyranny on behalf of its members.” “The overlap of these two SAG-AFTRA contracts,” she said, “is no coincidence, but rather a predictable issue impacting our industry as well as others all over the world.", "The disease of greed is spreading like wildfire ready to burn workers out of their livelihoods and humans out of their usefulness.", "We at SAG-AFTRA say ‘No.", "Not on our watch.’”\n\n> In addition to AI protections, SAG-AFTRA says it’s seeking “the same wage increases for video game performers as for those who work under the film and television contracts: 11% retroactive to expiration and 4% increases in the second and third years of the agreement — necessary for members’ wages to keep up with inflation.”\n\nThese are the 10 game companies along with some their tickers who would be impacted.", "- Activision Productions Inc., (ATVI being acquired by MSFT)\n- Blindlight LLC,\n- Disney Character Voices Inc., (DIS)\n- Electronic Arts Productions Inc., (EA)\n- Epic Games, Inc.,\n- Formosa Interactive LLC,\n- Insomniac Games Inc., (SONY)\n- Take 2 Productions Inc., (TTWO)\n- VoiceWorks Productions Inc., and\n- WB Games Inc. (WBD)"]}, {"title": ["Rite aid preparing for bankruptcy"], "text": ["The pharmacy chain is planning to file for Chapter 11 bankruptcy to address more than 1,000 state and federal lawsuits it faces for allegedly contributing to the opioid epidemic, according to the Wall Street Journal and Bloomberg.", "Rite Aid reported a net loss of $307 million in the first quarter of 2023, compared to last year’s first quarter net loss of $110.2 million.", "[Links](https://www.wsj.com/articles/rite-aid-prepares-bankruptcy-that-would-halt-opioid-lawsuits-69f94242?page=1)[WSJ](https://www.wsj.com/articles/rite-aid-prepares-bankruptcy-that-would-halt-opioid-lawsuits-69f94242?page=1)[Bloomberg](https://www.bloomberg.com/news/articles/2023-08-25/rite-aid-prepares-chapter-11-bankruptcy-to-restructure-debts#xj4y7vzkg)"]}, {"title": ["Did Oracle have an exaggerated fall?"], "text": ["Oracle, the software company just announced results that were within $20m.of expectations, but the stock fell 13.5% or a fall of about $30bn of market cap.", "Does anyone think this is irrational dumping or is there a reasonable explanation?"]}, {"title": ["What Happened to Disney (DIS) and Is it a Buy Right Now?"], "text": ["It's been going massively downhill in the last 1 year now and really 2 years from its high.", "I'm aware there's a WGA and SAG writers and actors strike right now that's impacting streaming, but beyond that, you'd think with pandemic lockdowns finally lifted, people traveling and vacationing during summer months, and fact it's reached expected earnings the last couple quarters, it might be down a little, but not the extent it currently is at.", "Any thoughts on Disney (DIS)?"]}, {"title": ["Spectrum owner Charter calls pay-TV model broken as it battles Disney over blackout"], "text": ["https://www.cnbc.com/2023/09/01/disney-charter-battle-over-spectrum-blackout.html\n\nCable giant Charter Communications and Disney are in a battle over contract fees that has left millions of people without access to U.S. Open, college football and potentially “Monday Night Football,” with the NFL’s season starting in just days.", "On Thursday, Disney said that the two companies have been in ongoing negotiations but yet to agree to a new deal.", "That resulted in Charter’s customers losing access to its networks, including broadcaster ABC and pay-TV channels such as ESPN and FX.", "Charter and Disney’s stocks were each down more than 2% on Friday.", "Charter’s Spectrum TV service has roughly 14.7 million customers across 41 states, with some of its top TV markets being New York, Los Angeles, Dallas-Fort Worth and Atlanta.", "These sorts of battles, which can lead to so-called blackouts for pay-TV customers, are common in the industry.", "But, in the age of streaming, this one is different.", "“This is not a typical carriage dispute,” Charter CEO Chris Winfrey said Friday on a call with investors.", "Early Friday, Charter executives called the pay-TV ecosystem “broken.” They said they pushed for a revamped deal with Disney that would see Charter cable customers receive access to Disney’s ad-supported streaming services like Disney+ and ESPN+ at no additional cost.", "This seemed to be the sticking point as Charter said it accepted Disney’s request for higher fees, although Charter executives didn’t provide specifics on the negotiations as they remain hopeful to get a deal done.", "Winfrey noted that in the last five years the entire pay-TV ecosystem has lost nearly 25 million customers, or almost 25% of total industry customers.", "“It’s staggering,” he said.", "Between the high cost of the traditional bundle and the option to switch to more affordable streaming options – most of which are provided by the same companies behind the networks on pay-TV – the speed at which cord-cutting is only accelerating.", "Live sports, particularly those shown on ESPN, have long been considered the glue holding the pay-TV bundle together, especially as customers flee for streaming services.", "The two companies renewed their contract in 2019, which also included Charter integrating Disney+ and ESPN+, as well as Hulu, into its set-top boxes to give customers more seamless access to those apps, CNBC previously reported.", "Charter, which also provides broadband and mobile services but is not in the content business, has said it values its pay-TV business and wants to see it thrive, even if it takes on a different form than the past.", "Disney CEO Bob Iger recently said on CNBC that assessing its traditional TV business is at the top of his list, and opened the door to potentially unloading these assets in a sale.", "The CEO, who returned to the helm late last year, said he realized the company is facing a lot of challenges, many of which are “self-inflicted.” Iger did note that ESPN is in a different bucket and Disney was instead open to selling a stake in the network while also moving toward a direct-to-consumer streaming service of its live feed."]}, {"title": ["UAW members go on strike at three key auto plants after deal deadline passes"], "text": ["Thousands of members of the United Auto Workers went on strike at three U.S. assembly plants of General Motors, Ford Motor and Stellantis after the union and the automakers failed to reach a deal on a new labor contract Thursday night.", "“The UAW Stand Up Strike begins at all three of the Big Three,” the union said in a post on X, the site formerly known as Twitter, just after midnight Friday.", "The facilities are GM’s midsize truck and full-size van plant in Wentzville, Missouri; Ford’s Ranger midsize pickup and Bronco SUV plant in Wayne, Michigan; and Stellantis’ Jeep Wrangler and Gladiator plant in Toledo, Ohio.", "For Ford, UAW President Shawn Fain said only workers in paint and final assembly will be on strike.", "“We got to do what we got to do to get our share of economic and social justice in this strike,” Fain said outside the Ford facility in Wayne.", "“We’re going to be out here until we get our share of economic justice.", "And it doesn’t matter how long it takes.”\n\nThe selected plants produce highly profitable vehicles for the automakers that largely continue to be in high demand.", "About 12,700 workers – 5,800 at Stellantis, 3,600 at GM and 3,300 at Ford – will be on strike at the plants in total, the union said.", "The UAW represents about 146,000 workers across Ford, GM and Stellantis.", "Read More:\nhttps://www.cnbc.com/2023/09/14/uaw-strikes-ford-gm-stellantis.html"]}, {"title": ["Why is VOO the one S&P ETF that everybody seems to recommend?"], "text": ["I would like to buy S&P 500, but with my broker  I would need additional bureaucracy to buy VOO.", "So I was wondering why everyone here seems to recommend this one specifically.", "I am able to buy iShares Funds easily and would simply stick to that if its all the same, but I am not sure if I am overlooking relevant differences here."]}, {"title": ["In 5 Years, Who do You Think Comes out on Top in the AI wars?"], "text": ["Microsoft?", "Amazon?", "Google?", "Apple?", "Even maybe Palantir?", "Nvidia?", "Or more than 1 of them?", "I think Microsoft is currently the best positioned with it's larger market share with Azure right now,  but Amazon is catching up with Lex and all of the AWS products.", "Google seems way behind both companies.", "Microsoft (at least right now) is also the most logically and fairly valued P/E wise (unlike say, Nvidia's astronomical PE) and I may dabble with a few grand bc it's cheap.", "They also have good cash on hand and good EPS.", "Not sure what to make of Apple or PLTR in the AI game, with PLTR some people say their products are the best and most proprietary and others are just \"meh\" on PLTR and say they are super overvalued.", "So who do you guys think will come out on top in the next few years in the AI arena?"]}, {"title": ["Instacart IPO announced-what do you think?"], "text": ["Instacart filed for its IPO yesterday (8/25), after dragging its feet since the pandemic when whispers of its debut began.", "What are your thoughts?", "I know IPOs have been hairy lately; does anyone have any plans of diving in for the long run?", "Personally, I’m intrigued based on the limited on-the-ground information I have.", "They’re *the* go-to for grocery delivery I’ve noticed.", "At least in my circle-lots of younger folks, especially higher income young professionals, use it very frequently.", "Their valuation is a lot lower from what they planned during the pandemic if I remember right, but I think especially in ever-popular urban areas, they’ve got a lock on the market.", "Moreover, as younger folks move out to the suburbs to get cheaper housing, they’ll likely remain loyal.", "It’s well priced as a service and people like it-and the grocers themselves seem to love it.", "Is there something I’m missing here?", "The most obvious threat I can think of is Uber’s continued horizontal integration across the delivery space; what is Instacart’s moat against that?", "Are there other serious flaws I’m not seeing or haven’t heard about?", "What do you guys think?"]}, {"title": ["Investing in water"], "text": ["No, I didn't just watch The Big Short last night.", "But I live in the Great lakes region and am seeing story after story about cities in Wisconsin, Illinois and Michigan seeing their water sources running dry and planning pipelines to draw from Lake Michigan.", "I hate reading that.", "But emotions aside, it appears that fresh water will continue to become a higher valued commodity.", "So what stocks / ETFs in the industry would you recommend, and why?"]}, {"title": ["AMC Up in Premarket After Raising $325.5M by Selling 40M Shares"], "text": ["[https://tokenist.com/amc-up-in-premarket-after-raising-325-5m-by-selling-40m-shares/](https://tokenist.com/amc-up-in-premarket-after-raising-325-5m-by-selling-40m-shares/)  \n\n\nAMC Entertainment's stock soared over 8% in premarket trading following the successful completion of its at-the-market (ATM) equity offering.", "The movie theater giant managed to rake in $325.5 million by offloading 40 million shares at an average price of $8.14 each.", "This financial shot in the arm comes at a crucial time for AMC, which has been grappling with liquidity concerns.", "The capital infusion also aligns with a 39% annual uptick in the industry's box office and AMC's monetization of the blockbuster 'Taylor Swift: The Eras Tour' film.", "However, the fundraising move hasn't been without its share of controversy.", "AMC's financial strategy has been under scrutiny ever since it became a 'meme stock' in 2021.", "Retail investors fueled a frenetic price surge, prompting AMC to issue new equity at the height of the frenzy, raising $587 million.", "Subsequent legal battles over a proposed conversion of AMC Preferred Equity units (APEs) and a reverse stock split complicated the company's efforts to stabilize its share price.", "This latest share offering follows a year in which AMC's stock price plummeted, erasing nearly 90% of its value.", "In spite of the past volatility and the risks flagged by AMC itself, the successful ATM equity offering suggests that investor enthusiasm for the company remains resilient."]}, {"title": ["If you had 5k to swing trade today what stock would you buy and why"], "text": ["I've been contemplating taking a gamble lately.", "Won't go into detail but I've got 5k spare sat around and a house deposit to pay for soon.", "I've been thinking about just gambling this 5k and taking whatever returns come my way.", "I've got a shortlist but wanted to hear some random opinions, as after all, this is a gamble :)"]}, {"title": ["Which stocks were predicted to be the next FAANGs and are now biting the dust?"], "text": ["I started investing about 5 years ago in 2018 and hence relatively a beginner.", "In the last few years several stocks were hyped to be the next FAANGs to generate 100-1000x returns.", "Some of them were\n\n \n\n* PTON - predicted to be the like Nike with $250B+ market cap\n* ZM - predicted to be a company where millions of people collaborate for work, 200B+ market cap\n* APPS - predicted to be next TTD (like 40B+ market cap)\n* OPEN - the next Amazon with $500B+ market cap\n\n&#x200B;\n\nThere were many other predictions which sounded ridiculous then, but has now become a reality or  getting there.", "(Say for eg: In 2018 Tesla car owners were really happy with what they bought and predicted it to be like Apple of EVs but I did not believe and did not invest.", "This was when TSLA was below 50B market cap.", "There was another narrative that Nvidia will be the biggest company in the world in next 7-10 years  which I missed too and its now on its path.)", "Which were some of the predictions that you heard years back and did not become a reality now and which are the predictions that you hear right now which you think will be reality in next 7-10 years?"]}, {"title": ["Need help $PYPL down bad."], "text": ["I bought Paypal at $145ish.", "Obviously I’m down bad.", "Real bad.", "I usually hold stocks long and barely ever sell.", "but this thing is sluggish, could possibly ssibly turn around soon but need so much momentum to even break even at this point.", "Their growth doesn’t seem to be headed in a major upward movement either.", "So my question is… should I sell for a giant loss and buy google or nvidia?", "Google is more enticing because the growth is great, solid company and the PE seems to be in a good spot.", "nvidia is obviously a great company but I’m worried with the price and PE already being so high.", "Any recs?", "**update***\n The “yeah, buy high, sell low” comments are nonsense.", "It’s not smart to ALWAYS hold on to your losers.", "As Buffett said “selling your winners and holding your losers is like cutting flowers and water the seeds”"]}, {"title": ["I'm in trouble I think"], "text": ["So I went with an advisor last September at Morgan Stanley.", "He re did my portfolio and then started talking to me about selling covered calls on my position of ETN.", "I explained to him that that options sound good as long as we have the possibility of closing out the option so to negat the risk of having the contracts exercised.", "He confirmed we could do that and said this was basically free money.", "We made anywhere from 1800 to 2000 on each contract.", "All was well but a couple months even more back i kept telling him we need to close out and just take whatever little premium we can get.", "I've done this with other options in the account   \n\n\nBut he never did it.", "I pay him a monthly fee to manage the account so I just figured of course he knows what he's doing more then i do.", "which is true.", "which is why i'm paying a professional.", "well, he now has 5 open contracts that in theory could be called which would force me to sell all my entire ETN position and well below current market price.", "Even after i told him not to open more contracts he went ahead and did right when i hung up with him lol   \n\n\nI don't know what to do now, i contacted his branch manager who appears to be on my side in all this thankfully.", "Maybe it's just going to be an expensive lesson, and that's not to trust anyone just because they have the credentials."]}, {"title": ["Has disney bottomed?"], "text": ["It looks to me like it bottomed or is close to it.", "I know it wont shoot up fast or anything but I can see it going back up to 100 within a few years.", "So you're looking at a nice 8%+ per year.", "It's very unlikely it could fall even more than 85 because the last time it was this low was 2014.", "Disney has grown much more in that time.", "Disney has also had a history of very good management, it will bounce back.", "I'm probably gonna park a little bit in it and consider it like a bond with decent upside.", "Also of course once the writer's strike is over, it will jump up.", "It doesn't matter what the deal they struck is because it can not be better than what they already got before the strike.", "There is only upside here."]}, {"title": ["Nintendo’s recent rumors and possible outcomes"], "text": ["The leak from a reliable source on Nintendo working on a VR set with Google is an interesting one.", "In the meantime an announcement of their next console should be drawing near.", "So personally I bought NTDOY.", "Nintendo has a good track record of innovation and novelty in their console features and games.", "So I expect them to do something new with both VR and their next console.", "However, keeping the Wii U in mind, there is a risk of these innovations and novelties not appealing to the wide market.", "They did believe in the idea though, and refined the Wii U into the Switch.", "Which in turn is a success.", "But there might be some unrefined ideas in the possible VR headset, and possibly this “Switch 2” console.", "Though, if Nintendo manages to make VR mainstream, it would once again be a game changer by Nintendo.", "Still.", "Along with their great results lately, I’m taking a chance on an upside of the rumors.", "I’m considering a larger position but would like to hear some input from others first.", "What are your thoughts?"]}, {"title": ["is it worth it to baghold blue chip stocks?"], "text": ["Holding a lot of shares of Disney, Intel, American express, Moderna, and Tesla.", "got some at ok prices, but some at the peak.", "If i just play the long game they’re bound to come back right?", "Some of these companies seem too big to fail like Disney.", "I’m 20 years old so i won’t need these for retirement or anything like that anytime soon.", "I sold apple and amd for a decent profit even tho i was bagholding those as well so hopefully the rest follow that trend?", "(man recency bias is real, i’m talking about bagholding for 1-5 years and you guys are basing all of your opinions on general headlines from the past month, y’all you really think these 5 companies are gonna go to shit? )"]}, {"title": ["Beaten down stocks that should reward over coming 10+ years"], "text": ["Many stocks (growth) have been badly beaten down in the past couple of years..and indeed many even face a couple more years of massive volatility.", "But what about the long term 10+ years.", "Which are fundamentally sound companies thayt should reward patient investors?", "Let's try to separate those that will become worthless from those who actually have a future."]}, {"title": ["Should I exit Intel as soon as it reaches my break even price?"], "text": ["I have 600 shares of INTC at aveage price of $41.", "Obviously, the thesis back in 2021 did not pan out and I've been waiting for it climb out of it's hole.", "Now that it's nearing (hopefully) my break even I'm wondering if I should sell some covered calls at $42 or just wait and get out ASAP.", "Position is in my TFSA.", "I am not yet certain where I will reallocate.", "A few months ago I was in a similar situation with Meta and got out too soon.", "Missed most of the run it went on and I'm still kicking myself.", "Any advice?"]}, {"title": ["T-Mobile announces $19 billion shareholder return program, including first-ever dividend payment"], "text": ["https://finance.yahoo.com/news/1-t-mobile-us-announces-181907396.html\n\nU.S. wireless carrier T-Mobile US said on Wednesday it has authorized a shareholder return program of up to $19 billion that will run through December 31, 2024.", "The company intends to declare and pay its first dividend of approximately $750 million in Q4 2023, as part of the return program.", "It will pay around $3 billion in additional dividends in 2024, with payments occurring each quarter during the year, along with share repurchases.", "T-Mobile added the dividend amount paid per share is expected to grow by around 10% annually.", "The shareholder return program is in addition to the company's previously announced $14 billion share repurchase program the Board authorized in September 2022."]}, {"title": ["Why do so many people here spend time picking stocks that are already a huge portion of the S&P?"], "text": ["I’m not somebody who believes in EMH and that it’s impossible to beat the market.", "But I do think you typically need a differentiated view (variant perception) and probably a mix of stocks that aren’t predominantly top 10 holdings in the index.", "It’s odd there is so little discussion here of small caps for a stock picking forum, IMO.", "So many posts I see here are a mix of Tesla, Amazon and Google, or similar.", "Do people think holding these stocks in some magic additional percentage (in addition to the fact they are likely already holding these stocks via index funds) is going to allow them to outperform for any meaningful period?", "Aren’t you just adding more risk and decreasing your Sortino ratio?", "Advocates of this approach, what am I missing?"]}, {"title": ["Your top 5 stocks for Black swan event"], "text": ["Hello,\n\nIn case if (or more like when) there is another Black Monday of 1987, dotcom bubble burst, financial crisis of 2008, or COVID 2020,...\n\nWhat would be your top 5 stocks to buy during the crash and why?", "Interested in everyone's picks and opinions, will look forward to your ideas!"]}, {"title": ["What Percentage of Your Portfolio is Cash?"], "text": ["My current portfolio is about 40% cash.", "I was planning on buying a house, but that doesn’t seem possible anymore.", "I’m not too sure if my cash position is too large and/or how to safely move said cash into other investments."]}, {"title": ["Sitting on $6700 cash.", "Where should I invest this?"], "text": ["\nHey everyone.", "I have bought some dumb stocks.", "And I’ve bought some good stocks.", "I’ve made money.", "But I’ve lost more than I’ve made on my dumb stocks.", "I finally bit the bullet and sold my shit stocks that I should’ve never been in.", "Basically dead in the water.", "Overall, I’d say I’m probably down $2500 over these 2.5 years.", "I have been sitting on $6700 cash in my Roth fidelity account for about 3 months.", "Afraid to get back in.", "What are some stocks i can throw a lot of this cash in to and just forget it.", "I currently have VOO, ICLN, and QQQ in my Roth.", "Honestly might sell all of these and start all over (only down a cumulative $250 with those 3).", "Thoughts ?"]}, {"title": ["Has the economy always been this volatile and confusing to read?"], "text": ["I only recently started following financial news.", "This past year, it's very evident that our economy is going through a tumultuous and volatile phase.", "However, I wanted to know if things have always been like this?", "Every other day someone is calling for a recession, and the days between, analysts are saying we're in for a soft-landing.", "Has this always been the case?"]}, {"title": ["British American Tobacco: Heads I win, tails I…still win"], "text": ["Hello, fellow investors!", "&#x200B;\n\n\nI have recently added British American Tobacco to my portfolio as I believe that its current share price presents an exceptionally compelling risk-reward proposition when weighed against alternative investment opportunities.", "Following is a concise summary of my reasoning that I would like to present for your feedback.", "**THE BEST OPPORTUNITIES ARE TO BE FOUND IN BEAR MARKETS**  \nSooner or later, regardless of how exceptional they are, companies find themselves in the midst of multi-year downturns.", "It happened to Coca Cola, PepsiCo, Microsoft, and Apple, just to name a few.", "The only time British American Tobacco has been cheaper than today was at the end of the largest civil litigation settlement in U.S. history, which resulted in the tobacco companies paying the states and territories billions of dollars in yearly instalments.", "*It went then on to become a* ***15-bagger*** *over the subsequent 17 years,* ***not accounting for dividends***.", "Now, the company does currently face noteworthy challenges (i.e.", "negative secular trends in smoking and a substantial debt burden), but the current valuation seems to be factoring in a higher level of risk than may actually exist.", "**DECLINING SMOKING RATES**  \nEven though smoking rates continue to decline, the company is effectively offsetting the trend through a successful diversification of its product portfolio.", "The oligopolistic nature of tobacco markets also gives them significant pricing power, especially since demand for their products is relatively inelastic, resulting in inordinate profitability and robust cash flows.", "**DEBT BURDEN**  \nThe company has debt maturities of around £4 billion annually in the next two years, and due to higher interest rates, net finance costs are expected to increase as debts are refinanced.", "However, it currently holds about £4 billion in cash, expects to generate at least an additional £5+ billion in post-dividend free cash flow, and had access to an undrawn £5.5 billion revolving credit facility as of 30 June 2023.", "This sums up to more than £14 billion in liquidity available to meet its debt obligations within the specified time frame.", "Contrary to claims of insolvency, the company's financials demonstrate otherwise.", "**HEADS I WIN, TAILS I...STILL WIN**  \nIt does not happen very often that companies with cash flows so consistent and predictable offer a ***FCF yield of 17%***.", "Not to mention the fact that they're still growing earnings and that a multiple expansion is not unlikely over the next decade (In 2000, the company traded at just 7x earnings before eventually returning to its historical norm of 13 to 14x).", "This is an ***immensely-wide moat and non-cyclical stock*** ***currently paying a 9% dividend yield*** with a conservative 60% earnings payout ratio and a well-established track record of dividend payments spanning many decades.", "Investors are getting average stock market returns from the dividend alone.", "I wanted to keep the post short and focus on the company's primary key facts, but I hope nonetheless you found the information interesting and worthy of further exploration!"]}, {"title": ["Why should PayPal go back up ?"], "text": ["I keep hearing people say that PayPal is undervalued and will go up again ... but why ?", "PayPal became famous cause it was one of the first companies to allow people to safely pay for things on the internet, but now that everyone (Visa, MasterCard, etc.)", "offers these services, why should anyone open a PayPal account ?", "What's the point ?", "Do they offer something that other companies don't ?", "I'm trying to understand the bull thesis on PYPL."]}, {"title": ["Foreign Investors Sold $9.8B of Chinese Stocks this Month"], "text": ["[https://tokenist.com/foreign-investors-sold-9-8b-of-chinese-stocks-this-month/](https://tokenist.com/foreign-investors-sold-9-8b-of-chinese-stocks-this-month/)  \n\n\nIn August 2023, foreign investors set a new record by divesting $9.8 billion in Chinese stocks, driven by escalating concerns over China's crumbling property market.", "This historic monthly sell-off highlights the crisis's impact on the local stock market, with offloaded stocks totaling 71.6 billion yuan ($9.8 billion), the highest since the mainland-Hong Kong stock trading link began in 2014.", "Despite mainland institutional investors expressing interest in Chinese stocks, the market continues to struggle.", "While foreign investors hold under 10% of A-shares by market cap, their preference for top-weighted stocks in the CSI 300 index grants them substantial influence.", "Although the index increased 0.72% to 3,723, it remains down over 7% since July.", "Rooted in China's property turmoil, responsible for a quarter of its economy, the sell-off follows Evergrande's bankruptcy protection filing due to a colossal debt exceeding $300 billion.", "As the property and broader economic concerns meld, experts caution that factors like tight loan conditions and muted consumer spending amplify the risk of an impending global recession."]}, {"title": ["Eurozone goes into recession; what sectors to buy?"], "text": ["LONDON, Aug 23 (Reuters) - Euro zone business activity declined far more than thought in August with the slide in Germany particularly fast, while some inflationary pressures returned, surveys showed.", "Wednesday's purchasing managers' indexes complicate matters for the European Central Bank which wants to control still rampant price rises without causing a recession.", "It is expected to pause interest rate hikes in September, according to a narrow majority of economists polled by Reuters, despite elevated inflation.", "A further rise in rates by year-end remains on the cards, however, following the central bank's most aggressive policy tightening cycle.\"", "So all and all things are not looking good.", "However  I have faith in the long term.", "What sectors wouls be good to buy during the current recession?"]}, {"title": ["Nvidia $25B buyback"], "text": ["Is this really a good use of resources?", "I don't know when the company last sold shares, but I doubt it was at a price higher than it is now.", "I thought buybacks were done when an issuer thought their stock was undervalued and could purchase it for less than originally sold.", "They could instead pay off all their outstanding notes, but considering the low rates on them, they could earn a risk free net return elsewhere.", "Doubling their dividend could be an attractive option.", "They have been paying only .04 a quarter when they use to pay .16.", "Companies lately have been choosing stock buyback plans rather than paying dividends or increasing them.", "While this can lead to a higher share price, it doesn't exactly return profits to investors like a dividend does.", "Deciding what to do with excess cash is a difficult decision.", "Reinvestment helps a company grow.", "Paying dividends adds value.", "I just don't really see the benefit of buybacks unless there aren't any better opportunities.", "Not at these prices anyway.", "What do you think?"]}, {"title": ["I have shares of a stock that are completely worthless.", "I want to get rid of them, how do I do it?"], "text": ["These shares have been completely worthless since 2014.", "They aren't worth anything and aren't trading.", "I have had them so long that my shares have been tossed around through clearing house brokers.", "I can't sell them, they aren't even on pink sheets.", "I am tired of getting quarterly updates that they are all worth exactly $0.", "I don't even care about writing it off as a loss.", "I bought some stupid stock while I was in college for $100.", "How do I get rid of these shares?", "?"]}, {"title": ["EU lists Alphabet, Amazon, Meta and three other tech giants as ‘gatekeepers’ under new competition rules"], "text": ["EU lists Alphabet, Amazon, Apple, Meta, Microsoft and ByteDance as gatekeepers.", "They have 6 months to comply with the Digital Markets Act.", "If no changes are made, firms could face fines up to 10% of their total global turnover.", "20% for repeated infringement.", "https://www.cnbc.com/2023/09/06/eu-lists-alphabet-amazon-meta-and-three-other-tech-giants-as-gatekeepers-under-strict-competition-rules.html"]}, {"title": ["how do investors justify buying nvda given the risks at this price?"], "text": ["their NVDA last annual revenue was around 26bil dollars, but around 30% came from taiwan, 20% came from china, 25% came from other foreign countries ex-US.", "so majority is foreign country and its likely the us will put more restrictions on sales from china, which will just crash their biggest customer market.", "there's also uncertainty to how much will come from taiwan or other foreign countries if those places have a recession or something, if this was ANY other company the stock will tank, but since its the biggest chip company here and people think it can just outmanuver policy or maybe a recession?", "how is that even justified?", "so even if the us market doesnt have a recession how would it be able to recover uncertainty in sales declines from other markets?"]}, {"title": ["Diversifying a tech heavy portfolio — opinions?", "Wasteful?"], "text": ["I have $40k invested.", "I have a low income (~$20k annually) but have been investing for 3-4 years now.", "My portfolio is very tech heavy.", "Amazon, Tesla, Apple, and Google is where my bulk is.", "I was thinking of setting up a recurring investment in to SPY and VOO.", "Maybe $100 a month in to each.", "Would this be worth it?", "My investment strategy is long term, 20+ years with a desire to retire in 20 years based off this portfolio.", "Or, would my money be better continue going in to my tech stocks?"]}, {"title": ["I read Thinking Fast and Slow and wanted to share the ways this book helped me make better investment decisions"], "text": ["Strictly speaking, *Thinking Fast and Slow* is not an investing book, but I've seen it referenced and quoted so many times in other investing books that I simply had to go read it for myself.", "I'm very glad to say that I had not wasted my time and this is an excellent book on all aspects of decision making.", "Daniel Kahneman is the foremost expert in the field of decision-making and judgement, even receiving a nobel prize in 2002 for his contributions to the field of behavioural economics.", "Kahneman covers a lot of ground in this book, but for the purposes of this post, I'll be focusing mainly on what he has to say about our money decisions.", "* ***Anchoring***\n\nThe anchoring effect is the tendency for a given number to affect people's estimation of an unknown value, regardless of whether the given number resulted from a dice throw or in-depth calculation.", "Kahneman and his research partner Amos Tversky rigged a wheel of fortune to only land on 10 or 65.", "Then they invited university students in for an experiment.", "First, they spin the wheel, then had the student write down the number it landed on.", "Afterwards, Kahneman and Tversky asked the students \"Is the percentage of African nations among UN members larger or smaller than the number you just wrote?", "What is your best guess of the percentage of African nations in the UN?\"", "Students know that the number was produced by random, the written number should not have any influence on the students' estimation of African nations in the UN.", "Yet on average, those students who got 10 estimated 25% while those who got 65 estimated 45%.", "In the instance of estimating the intrinsic value of a stock, we are similarly persuaded.", "**The given number (stock price) will inevitably influence our estimation of the stock's true worth unless we're exceedingly wary.", "It's for this reason that overpriced stocks look attractive while underpriced stocks look risky.", "** Despite the fact that we should not let the actual price of a stock influence our calculation of its intrinsic value, most of us can't help but do so due to the anchoring effect.", "For example, imagine you have a normal plastic bag.", "If asked, we might say it's worth a nickel at most.", "However, if the store priced the plastic bag at $1000 and hundreds of people purchased it for that price, we might be persuaded that the plastic bag is worth more when it's not.", "* ***Overconfidence***\n\nSystem 1 is unconscious and therefore, it isn't able to second-guess and self-evaluate its judgements.", "Paired with a lazy System 2, it's only too easy for people to form beliefs that lack evidence.", "**Confidence, contrary to what our intuition says, is not an indication of correctness.", "In fact, the more confident we are, the more vigilant we should be.", "** In the case of investing, it's important not to be led astray by overconfidence, both your own and that of investing professionals.", "Given the danger and prevalence of overconfidence, Kahneman offers us a thought experiment called the postmortem to help diminish the tendency.", "Postmortem is where you imagine that the project you're about to embark upon or the business you're about to invest in had failed 15 years down the line.", "You then take 5-10 minutes to brainstorm how this might have happened.", "In performing this exercise, you inoculate yourself against overconfidence and create opportunity to pre-empt future mistakes.", "* ***Loss Aversion***\n\nAt the core of many of our poor money choices lie loss aversion.", "The idea is that most people feel the loss of something far more acutely than they feel the gain.", "Through his research, Kaneman found that the ratio of loss aversion measures out to 1:2 or 1:1.5 on average.", "This means you must earn $200-$150 to offset the psychological pain of losing $100.", "Although it's reasonable to protect wealth more fiercely than pursue gains, many people are loss averse to the point of irrationality.", "When faced with an offer of \"pay $400 for 95% chance to win $1,000\" OR \"pay $700 to win $1,000 for sure\" most of us would go with the second option.", "Objectively speaking, 95% chance to win $600 is an excellent deal, yet we are willing to pay a hefty premium to eliminate the negligible chance of losing money.", "To resolve this in-equivalency Kahneman recommends taking a broadview perspective when investing.", "**We are not making a single investment, we are making a number of investments that will average out.", "Waiting until we come upon an opportunity that offers 100% guarantee to make money means we'll never invest at all.", "** It may also mean we end up relying solely on bank deposits with returns that fail to keep up with inflation, an inevitable result of loss.", "Yes, it's likely that some investments will come out at a loss, but as long as you make more good investments than bad, your net result will follow the trend of probability.", "Meanwhile, if you shy away from good deals, these missed opportunities will gradually accumulate into a big loss.", "* ***Attitude to Risk***\n\nIn Kahneman and Tversky's Nobel Prize-winning theory called Prospect Theory, they posited that just as there are diminishing returns for gains, there is a similarly diminishing impact for losses.", "Kahneman offers two illustrative problems to explain prospect theory:  \n***Problem 1****: Which do you choose?", "*  \n*Get $900 for sure OR 90% chance to get $1,000*  \n***Problem 2****: Which do you choose?", "*  \n*Lose $900 for sure OR 90% chance to lose $1,000*\n\nAs mentioned in the previous point on Loss Aversion, most people would much prefer to get $900 for sure for Problem 1.", "What's interesting is that this situation is entirely inverted in Problem 2.", "All of a sudden, people would prefer a 90% chance to lose $1,000 over a guaranteed loss of $900.", "The reason is because going from $900 to $1,000 is an insignificant increase in psychological value and the 10% risk of getting nothing at all is a huge loss.", "We are unwilling to put $900 on the line for a chance to gain an additional $100, even when the odds of success is 90%.", "When it comes to gains, we are risk averse.", "Meanwhile, going from a sure loss of $900 to a potential loss of $1,000 is precisely the opposite.", "If we are guaranteed to lose $900, the loss of an additional $100 feels negligible.", "In exchange for the possibility of losing an additional $100, we gain a 10% chance to lose nothing at all, which has much greater psychological value.", "When it comes to losses, we are risk seeking.", "Why is this important?", "**Consider we purchased a stock for $80 a share and it has gone down to $30.", "We know the company is performing poorly and the economy is entering a recession.", "The odds that the stock will drop to $20 and stay at that price is 90%.", "The smart decision is to sell the stock at $30 and reinvest in another stronger company, but because we are risk seeking when faced with loss, we hold on to the stock for that slim 10% chance that it will bounce back to $80 a share.", "** This is the reason why we hold on to losing stocks and refuse to realize a loss.", "Selling now and losing $50 for sure feels much worse than a 90% chance to lose an additional $10 and a 10% chance to make it all back.", "&#x200B;\n\n**The good:** This book is full of excellent psychological concepts presented alongside compelling examples, both in the form of theoretical thought experiments and actual experiments conducted by experts.", "Kahneman not only taught me lots of new psychology concepts but also explained familiar concepts (priming, availability heuristic, loss aversion) in a new way so I had a truer, deeper understanding.", "This book will be of great use to anyone who makes decisions on a regular basis.", "**The bad:** As you can imagine, this book goes very fast, especially in the later chapters.", "It sometimes felt like concepts that deserved its own chapter (or even its own book) are allotted only pages and paragraphs, which is a shame.", "This book also lacks a clear progression of ideas, it very much feels like a bunch of related but disparate concepts packaged together into a book.", "**Personal thoughts:** I really enjoyed this book and I highly recommend it.", "It's a fairly long read (my edition was 499 pages) and at times rather dense, but it's well worth the time and effort.", "While writing this review I really struggled to choose which concepts to include and which to leave out because all of the ideas from Thinking Fast and Slow feels so fundamental to the way we make decisions.", "If you've read this book too, I would really appreciate it if you drop a mention of something from the book I wasn't able to cover because goodness knows there are a lot."]}, {"title": ["MercadoLibre seems absurdly undervalued."], "text": ["My portfolio is up 50% this year.", "I have a portfolio that is 100% growth stocks and I’ve taken some time to look at valuations to evaluate if I have companies that seem to be over their skis in terms of valuation.", "I’ve been looking at lots of stocks in terms of reverse dfc and it seems to me that MercadoLibre is undervalued by about 50%.", "They are still growing sales by more than 30% y/y and are improving their operating margin by increasing take rates and reducing costs.", "They turn out outstanding results quarter after quarter and when faced with competitive threats from players such as Amazon and Shopee, they just keep coming out on top.", "I have a somewhat focused portfolio of 9 stocks, but with the numbers I’m seeing, I just really want to put everything into MercadoLibre (not that I have a big portfolio - just around 30k)\n\nEvery other growth stock I evaluate seems either overvalued or reasonably valued, taking into account ten years of reasonable growth assumptions.", "Take Nvidia for example.", "I own Nvidia and based on my reverse DCF, if they can grow FCF by 30% for ten years, the stock is currently fairly valued.", "I think they might be able to pull that off, so Nvidia might be worth owning.", "But according to the same model, MercadoLibre only needs to grow FCF 11% annually over the next 10 years to justify their current valution.", "This just seems like an absurdly low bar for them.", "If my model is off, it would be off in the same direction for all the companies im evaluating.", "Part of me thinks I should just invest in this one company that has both amazing fundamentals and low valuation.", "Another part of me is just saying “hell no!", "Always stay diversified!”\n\nIt’s like Cramer vs Munger in my head.", "One voice says “5 stocks minimum”.", "The other says, “why buy anything but your best idea?”  Peter Lynch is also in my head.", "I live in Mexico and use Mercado Libre’s services, so it’s a company I can get behind on a personal level.", "I think Lynch would approve.", "I’ve just never put all my money into one stock before, but this seems like an insane bargain.", "What do you think?", "I’d love to either be talked off the ledge here or encouraged."]}, {"title": ["WeWork’s Shares Up 87% on Tuesday, Post Biggest 1-Day Gain"], "text": ["[https://tokenist.com/weworks-shares-up-87-on-tuesday-post-biggest-1-day-gain/](https://tokenist.com/weworks-shares-up-87-on-tuesday-post-biggest-1-day-gain/)  \n\n\nIn a surprising development, WeWork's stock price soared by almost 87% in a single trading day, the largest one-day gain since its October 2021 public debut.", "This surge is particularly noteworthy given the coworking company's recent financial struggles, including a dire warning last month of a potential collapse.", "The stock's trading volume skyrocketed to 47.5 million shares, dwarfing its past month's full-day average of just 2.4 million, yet no specific event has been identified as the catalyst for this dramatic rise.", "Even as its stock showed this unexpected buoyancy, WeWork's challenges persist.", "The company is still nearly 90% down year-to-date and recently executed a 1-for-40 reverse stock split to avoid being delisted from the New York Stock Exchange.", "WeWork has also posted a net loss of $397 million in Q2 of this year, heightening concerns about its financial stability.", "This sudden surge in stock price, devoid of any obvious trigger, raises questions about whether we're witnessing another meme stock phenomenon or if this signifies a turning point in the company's fortunes."]}, {"title": ["What is your exit strategy?", "Can anyone give me a hint?"], "text": ["I think not enough discussion has been done about how to exit a trade.", "I am pretty discipline with cutting my loss but I am always at odds at when do I exit my trade when it's at profit.", "I am currently trying to employ a take profit system to automatically take profit when the stock that I owned gained a certain percentage of profit but an acquaintance told me that it will not maximize my profit.", "Can anyone share how they do it or even better point to a system that I can learn for my trade?", "Thank you very much!"]}, {"title": ["How likely is it that S&P 500, NVDA, and AMD return 10+% a year in the current economic environment?", "Impact of interest rates."], "text": ["Mortgage interest rates are so high for some people that they need to make 10+% profit in stocks a year to justify holding stocks instead of paying off the debt.", "That means less than 10% profit is a loss for those people.", "The question is how likely 10% or higher return is.", "This is based on my personal situation.", "Holding NVDA and AMD."]}, {"title": ["Wouldn't it be much more logical to swing trade in Roth IRA's and long-term hold in regular accounts instead of the exact opposite?"], "text": ["Wait a second before you have a meltdown over this.", "Hear me out, then tell me that I'm a dumbass.", "It's my belief that most people turn into the Boglehead types over time because of their experiences with paying taxes on short-term capital gains and long-term capital gains.", "Newer investors don't have the experience with dealing with their taxes as much, so they tend to swing for the fences with shorter-term positions.", "More seasoned investors tend to buy and hold, but this is a learned behavior because they know that their absolute worst case tax scenario on a long-term gain is 20 percent (federally).", "Of course, you only pay the 20 percent on long-term cap gains if you're income is over like 492k or something.", "Most end up paying about 15 percent federal tax on their long-term cap gains.", "Short-term cap gains seem to be taxed almost double that amount, obviously it depends on your exact tax bracket situation, but you get the point.", "Thus, it's been beaten into the heads of seasoned investors that it's just smarter in the long run to hold positions for at least a year, because your tax bill is often cut in half, or almost in half.", "You do this long enough, and it becomes ingrained in your investing personality.", "All of this makes perfect sense to me.", "Ok, now let's talk about Roth IRA's.", "With Roth IRA's, if you're doing things correctly, there's ZERO taxes on your earnings when you're taking your money out.", "Obviously you need to be 59 1/2 years old and you need to have passed the 5-year rule, etc., etc.", "But if ultimately there's no tax implications whatsoever for investments that are under the Roth umbrella, why do most people tend to hold things for the long-term, and be ultraconservative?", "**WAIT!", "**\n\nI already know what you're going to say, but I'm going to argue that it's nonsensical.", "You're going to say because Roth IRA's are designed for retirement, and when you get up to that age you should be a lot more risk adverse, because you really need this money for your retirement and you can't be screwing around, taking penitentiary chances.", "However, here's my argument to that.", "Consider all of your investments, Roth and normal brokerages as this large bucket of water.", "Most ~~people~~ investors will have a Roth account and a regular brokerage account.", "Due the limitations on how much you can get into a Roth each year, it's likely that most people will have at least 5 to 6 times as much money in their regular brokerage accounts as their Roth accounts.", "For example....", "Imagine somebody has 50k grand total in various Roth accounts.", "Maybe a standard issue Roth and a 401k Roth.", "But they have 250k in a \"normal\" brokerage account.", "In this scenario, less than 17 percent of their overall investment money is in their Roth.", "So, the argument that they need to be ULTRA CAREFUL WITH THEIR ROTH MONEY is pretty illogical, because it's such a small percentage of their overall scenario.", "**Wouldn't it be tremendously more logical to actually trade that 17 percent of their account more aggressively, when it's the only 17 percent that isn't negatively affected by moving in and out of stocks?", "**\n\nThink about the guy that has Microsoft stock.", "Been holding MSFT for years.", "He knows the ups and downs.", "The peaks and valleys.", "He can probably tell you countless times he would have taken profits if only there wasn't a major tax consequence.", "So, he doesn't take profits when the stock gets ahead of itself, and then buy back in during a retracement.", "But his reasoning is tax implications.", "Inside a Roth, there's no tax implications.", "Thus, this same investor could sell out of MSFT when he thinks it's gotten ahead of itself, and then buy back in during a retracement and end up with more overall shares.", "All with no taxable implications whatsoever.", "Now obviously, nobody can predict the future and sometimes people are going to get it wrong.", "They'll sell MSFT when they think the stock has gotten way ahead of itself and then it continues to go on a tear and now he can't buy back in and still have the same number of shares.", "But by the same token, just talk to any Amazon investor over the last three years.", "That shit has basically gone pretty much nowhere for a three-year period.", "So the whole buy and hold forever strategy hasn't worked out that great for AMZN holders.", "It cuts both ways.", "Don't just cherry pick the example of it hurting."]}, {"title": ["Coca Cola vs Pepsi vs Monster"], "text": ["I plan on adding a soft drink company to my portfolio, because I don't feel like adding up on my positions, which are quite pricy, nor buying something like the QQQ or any growth fund which would increasingly expose me to tech.", "The three choices are obviously Coca Cola, Pespsi and Monster.", "Coca cola is the one trading at the lowest multiple, paying the highest dividend, and arguably the one with stronger brand recognition.", "I really like the fact that they are deleverging and consistently paying off their debt, however the growth has been lagging behind.", "Has less than half the revenues of Pepsi does (43bln vs 92 bln), but just over twice the net margins.", "I would say its the safest play.", "Pepsi has done I think decent acquistions ( ex, Doctor Pepper ), and is growing slightly faster than Coke with a lower dividend.", "Very stable growth, a fair amount of debt (nothing too concerning).", "Monster growth has been, well, Monstrous.", "However the PE is 41 (10 more than pepsi, 16 more than coke), and since they never paid dividend the balance-sheet looks incredible.", "They have more cash than all liabilities, and are already doing buybacks, which for fast growing company is quite nice,as it means they can already return capital to shareholders while expanding operations, without using debt.", "I am not saying it is undervalued (PE 41), but given the current multiples and its track record, it doesn't seem too bad.", "The brand doesn't have the same track record of the other two, but is well known and the managment seems to know how to keep it relevant and in touch with consumers preferences.", "I don't think its going away (stressed overworked people needs energy drinks haha) but the future might be more uncertain than with the other two.", "What are your thoughts on these companies?", "&#x200B;\n\n&#x200B;"]}, {"title": ["Why is Walmart (WMT) doing significantly better than Target (TGT) when they're doing the same thing?"], "text": ["Both Walmart and Target essentially sell the same exact items more or less and their financials are both hitting expected EPS.", "Aside from Walmart's larger market cap and company size, is there a reason why Target is performing horribly right now (Down 25% in the last year), while Walmart is performing wonderfully (Up 15% in the last year)?", "Costco is another 1 to bring up if anyone wanted to share an opinion about that as well."]}, {"title": ["TD transition to Schwab is underway.", "What are your thoughts?"], "text": ["I for one welcome my new overlords.", "I'll be interested to see how the new web UI looks, but I like the way they break our my corporate and individual accouts so far...\n\n&#x200B;\n\nAny thoughts?", "Anyone leave to another platform or do you just not care?"]}]